import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const AbbaskaAlam = () => {
  return (
    <View>
      <Text style={styles.text}>
            اونچا رہے اونچا رہے غازی علم تیرا
            ہر دور میں اونچا رہا غازی علم تیرا

            {'\n\n'}چودا سو برس سے جھک نا سکا
            یہ رب کا کرم ہے
            عباس کا علم ہے

            {'\n\n'}پنجہ ہے جلال دست خدا
            پٹکا اس کا زینب کی ردا
            تعویذ وفا ہے مشکیزہ
            یہ مشک و علم ھونگے نا جدا
            پاتکی پر رقم ہے
            عباس کا علم ہے

            {'\n\n'}صدیوں پے محیت اس کا سایہ
            یہ شان وفا کی کہلایا
            حیدر نے محمد سے پایا
            زینب کی دعا زہرہ کی عطا
            پیاسو کا بھرم ہے
            عباس کا علم ہے

            {'\n\n'}گھر گھر سے جلوس غم نکلے
            تابوت کے ساتھ علم نکلے
            ہم کرتے ہوئے ماتم نکلے
            روکے جو جلوسو کا رستہ
            اب کس میں یہ دم ہے
            عباس کا علم ہے

            {'\n\n'}چودا سو برس سے جھک نا سکا
            یہ رب کا کرم ہے
            عباس کا علم ہے

            {'\n\n'}گو لاکھ مٹانا چاہا مگر
            جاری ہے آزاداری کا سفر
            ہر سمت علم آتے ہیں نظر
            مٹ پایا نہیں جھک پایا نہیں
            دُنیا کو یہ غم ہے
            عباس کا علم ہے

            {'\n\n'}آ دیکھ زمانے دیکھ ذرا
            یہ پاک علم کی پاک ہوا
            کرتی ہے عطا دیتی ہے شفاء
            گھبرانا نہیں کہیں جانا نہیں
            جو مانگو وہ کم ہے
            عباس کا علم ہے

            {'\n\n'}ہمزاکو ملا جعفر کو ملا
            پِھر خیبر میں حیدر کو ملا
            حیدر سے دِل سرور کو ملا
            نسبت کا شرف یا شاہ نجف
            کیا جاہو ہاشم ہے
            عباس کا علم ہے

            {'\n\n'}چودا سو برس سے جھک نا سکا
            یہ رب کا کرم ہے
            عباس کا علم ہے

            {'\n\n'}تاریخ الامداری ہے علم
            زینب کی آزاداری ہے علم
            زہرہ سے وفا داری ہے علم
            دیتی ہے سدا یہ شاہ کی عزا
            رہبر جو علم ہے
            عباس کا علم ہے

            {'\n\n'}جب بھاروا (12) حیدر آیگا
            حق کیا ہے پتہ چل جائیگا
            کابے پے علم لیہرائے گا
            یہ منظر ہاں دیکھے گا جہاں
            اونچا جو علم ہے
            عباس کا علم ہے

            {'\n\n'}جب حشر کی دھوپ میں پوہنچے گے
            غازی کا علم جب دیکھیں گے
            فرحان اور مظہر کہدے نگے
            اب روزِ قیامت کا ہم کو
            نا ڈر ہے نا غم ہے
            عباس کا علم ہے

            {'\n\n'}چودا سو برس سے جھک نا سکا
            یہ رب کا کرم ہے
            عباس کا علم ہے

            {'\n\n'}اونچا رہے اونچا رہے غازی علم تیرا{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default AbbaskaAlam;
