import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const GhameHussain = () => {
  return (
    <View>
      <Text style={styles.text}>
        مولا مولا مولا حسینؑ
        حسینؑ حسینؑ حسینؑ مولاؑ

        {'\n\n'}اے مئی پیغامے جہان آر
        دار دلام
        غمِ حُسین دلام دلام دار دلام
        دار دلام

        {'\n\n'}غمِ حُسین دارئے انڑزی چھمّامُ بیارئے
        مولا راضی بئیے شُواراش
        دار دلام
        غمِ حُسین دلام دلام دار دلام

        {'\n\n'}آھنی مجلس پچارئے پیاس نی پیاس سارئے
        مولا گو وفا کھنئے ھما یادا شُوا بیارئے
        غمِ حُسین دارئے انڑزی چھمّامُ بیارئے
        مولا راضی بئیے شُواراش
        دار دلام
        غمِ حُسین دلام دلام دار دلام
        مولا مولا مولا حسینؑ

        {'\n\n'}شہیداں ھوُنے کَھتھا ھَمہ بی سا خاکِ شفا
        ماں جو سجدہ خُزاؤں آختا تھئی یاد منا
        غمِ حُسین دارئے انڑزی چھمّامُ بیارئے
        مولا راضی بئیے شُواراش
        دار دلام
        غمِ حُسین دلام دلام دار دلام

        {'\n\n'}غمِ اکبر مزائیں غمِ اصغرمزائیں
        غمِ زینب مزائیں غمِ چادر مزائیں
        غمِ حُسین دارئے انڑزی چھمّامُ بیارئے
        مولا راضی بئیے شُواراش
        دار دلام
        غمِ حُسین دلام دلام دار دلام
        مولا مولا مولا حسینؑ

        {'\n\n'}خالی غم ماں نہ خُزاؤں ھَمیں نبیاں د خُزا
        نوخ اِستارے خُزا ھَمیں ولیاں د خزا
        غمِ حُسین دارئے انڑزی چھمّامُ بیارئے
        مولا راضی بئیے شُواراش
        دار دلام
        غمِ حُسین دلام دلام دار دلام

        {'\n\n'}قادر شاہ لِکھ سو رَوئے بس ھَمیں شاہ نی غم
        عُمر بھر نوحہ پڑھاں زُڈ تھو فرحان قسم
        غمِ حُسین دارئے انڑزی چھمّامُ بیارئے
        مولا راضی بئیے شُواراش
        دار دلام
        غمِ حُسین دلام دلام دار دلام
        مولا مولا مولا حسینؑ{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default GhameHussain;
