import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const Hussaintere = () => {
  return (
    <View>
      <Text style={styles.text}>
            یا حسین حسین یا حسین
            حسین تیرے لہو کی خوشبو
            فلک كے دامن سے آراہی ہے

            {'\n\n'}حسین تیرے لہو کی خوشبو
            فلک كے دامن سے آراہی ہے
            یہ خون نا حق چھپے گا کیوں کر
            جسے یہ دُنیا چھپا رہی ہے
            حسین تیرے لہو کی خوشبو
            فلک كے دامن سے آراہی ہے
            یا حسین حسین یا حسین

            {'\n\n'}حسین لاشا جواں کا لے کر
            چلے ہیں مقتل سے سوئے خیمہ
            مگر ضعیفی قدم قدم پر
            اٹھا رہی ہے بیٹھا رہی ہے
            حسین تیرے لہو کی خوشبو
            فلک كے دامن سے آراہی ہے
            یا حسین حسین یا حسین

            {'\n\n'}یہ کون ہے جسکی گفتگو میں
            علی کا لہجہ جھلک رہا ہے
            یہ کون ہے جس کے وال والو میں
            حسینیت جاگ مگا رہی ہے
            حسین تیرے لہو کی خوشبو
            فلک كے دامن سے آراہی ہے
            یا حسین حسین یا حسین

            {'\n\n'}با رہنا سَر ہے علی کی بیٹی
            مگر وہی عظمت محمد
            وہ جسکی خاطر بھرا ہُوا گھر
            لٹا کے کربل سے آراہی ہے
            حسین تیرے لہو کی خوشبو
            فلک كے دامن سے آراہی ہے
            یا حسین حسین یا حسین

            {'\n\n'}پُکاری دشت بلا میں زینب
            کہا ہو عباس لوٹ آؤ
            اٹھا کے ہاتھوں میں خالی کوزا
            سكینہ تم کو بلا رہی ہے
            حسین تیرے لہو کی خوشبو
            فلک كے دامن سے آراہی ہے
            یا حسین حسین یا حسین

            {'\n\n'}بجھا کے پیکا سے پیاس اپنی
            تو گرم ریتی پے سو رہا ہے
            تجھے خیالوں میں اب بھی اصغر
            رُباب جھول جھولا رہی ہے
            حسین تیرے لہو کی خوشبو
            فلک كے دامن سے آراہی ہے
            یا حسین حسین یا حسین

            {'\n\n'}دیارِ شام و دیار کوفہ
            جو ہوکے اے ہے بنتِ زہرہ
            نبی کے روزہ پے جاتے جاتے
            نشاں رسا ن کے چھپا رہی ہے
            حسین تیرے لہو کی خوشبو
            فلک كے دامن سے آراہی ہے
            یا حسین حسین یا حسین

            {'\n\n'}کہا ہے مقتل کہا مدینہ
            تڑپ کے بولی یہ ا ُمے سلمہ
            جو غش سے جاگی ہے تیری صغرا
            بس ایک نوحہ سنا رہی ہے
            حسین تیرے لہو کی خوشبو
            فلک كے دامن سے آراہی ہے
            یا حسین حسین یا حسین{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default Hussaintere;
