import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const KaisayMain = () => {
  return (
    <View>
      <Text style={styles.text}>
            شام كے زندان میں اک چھوٹی سی قیدی
            ہاتھوں میں پاؤ میں اور گردن میں ہے رسی
            اور سینے پہ بابا کا ہے سَر ، سَر سے ہے لپٹی
            منہ پہ منہ کو رکھ كے بہت دیر وہ روئی
            ہائے روتے روتے اُس نے جو لی آخری ہچکی
            زندان میں دم توڑ گئی شاہ کی پیاری
            سكینہ سكینہ

            {'\n\n'}کرتے تھے سجاد یہ نوحہ
            کیسے میں دفنائوں سكینہ
            سكینہ
            کیسے میں دفنائوں سكینہ
            کیسے میں دفنائوں سكینہ

            {'\n\n'}قیدی اگر قید میں مر جاتا ہے کوئی
            لاش کو رسی سے چرا دیتے ہیں اُسکی
            ہائے زخموں میں پَیوسْت رساں ہے تیرے ایسے
            میں نے تیری لاش سے رسی نہیں کھولی
            لاشا بکھر جائے کہیں نا
            کیسے میں دفنائوں سكینہ
            سكینہ
            کیسے میں دفنائوں سكینہ
            کیسے میں دفنائوں سكینہ

            {'\n\n'}خون رُلاتا ہے یہ منظر میری بہنا
            جسم تیرا خون میں ہے تر میری بہنا
            ہاتھوں پہ لاشا ہے تیرا سوچ رہا ہوں
            غُسل کو پانی بھی میسر نہیں بہنا
            تو ہی بتا دے میری بہنا
            کیسے میں دفنائوں سكینہ
            سكینہ
            کیسے میں دفنائوں سكینہ
            کیسے میں دفنائوں سكینہ

            {'\n\n'}کیسی مصیبت یہ پڑی دور وطن سے
            بابا بھی محروم ہے اور تو بھی کفن سے
            چاہوں چُھرانا تو چُھرا بھی نہیں سکتا
            خون بھرا کُرتا جو چِپکا ہے بدن سے
            تیرا کفن ہے یہی کُرتا
            کیسے میں دفنائوں سكینہ
            سكینہ
            کیسے میں دفنائوں سكینہ
            کیسے میں دفنائوں سكینہ

            {'\n\n'}یاد مجھے آتا ہے اے غم زدہ خواہر
            مجھ سے یہی پوچھتی رہتی تھی تو اکثر
            دفن میں ہوجاؤں اگر قید سِتم میں
            شیمر نا آجائے کہیں میری لَہد پر
            اب اسی زندان میں دُکھیا
            کیسے میں دفنائوں سكینہ
            سكینہؑ
            کیسے میں دفنائوں سكینہ
            کیسے میں دفنائوں سكینہ

            {'\n\n'}تو ہی نہیں تیری تو سانسیں بھی تھی قیدی
            دیکھی نہیں پہلے کہیں ایسی عسیری
            سونا جو چاہا تو تجھے نیند نا آئ
            رونا جو چاہا تو تماچوں کی سزا تھی
            ہوگی تیری قبر بھی تنہا
            کیسے میں دفنائوں سكینہ
            سكینہ
            کیسے میں دفنائوں سكینہ
            کیسے میں دفنائوں سكینہ

            {'\n\n'}مظہر و فرحان یہی بات ہے نوحہ
            ہاتھوں پہ اک قیدی کے اک قیدی کا لاشا
            کیسے باندھے ہاتھوں سے میں قبر بناؤ
            سب کو رُلاتا تھا یہ سجاد کا جُملہ
            ہائے وہ سجاد کا کہنا
            کیسے میں دفنائوں سكینہ
            سكینہ
            کیسے میں دفنائوں سكینہ
            کیسے میں دفنائوں سكینہ

            {'\n\n'}سكینہ{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default KaisayMain;
