import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const SaatQadam = () => {
  return (
    <View>
        <Text style={styles.text}>
            اللہ اللہ اللہ

            {'\n\n'}کیسا امتحان ، کیسا امتحان ، کیسا امتحان
            کیسا امتحان ہے حسین کا

            {'\n\n'}ساتھ قدم آگے بھڑہے کیوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین

            {'\n\n'}پہلے ( 1 ) قدم پر یہی سوچا
            جرم تھا اصغر کا بھلا کیا
            ہائے دیکھ كے یہ ناننا سا لاشہ
            غم سے نا مرجائے سكینہ
            تھام كے دِل رونے لگے یوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین
            ساتھ قدم آگے بھڑہے کیوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین

            {'\n\n'}دوجے ( 2 ) قدم پر کہا رو کر
            کیا کروں بتلا علی اصغر
            ہائے دیکھ لیا اس نے تجھے گر
            مر ہی نا جائے تیری مدار
            تھام كے دِل رونے لگے یوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین
            ساتھ قدم آگے بھڑہے کیوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین

            {'\n\n'}تیسری ( 3 ) بار ایسا ہُوا تھا
            خیمے میں جانے لگے مولا
            ہائے جھونکا چلا تیز ہوا کا
            ہٹنے لگا لاشے سے کپڑا
            تھام كے دِل رونے لگے یوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین
            ساتھ قدم آگے بھڑہے کیوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین

            {'\n\n'}ہائے جوں ہی قدم چوتھا ( 4 ) اُٹھایا
            غازی کو رُو رُو کے بُلایا
            ہائے کہنے لگے بھائی تو آجا
            خیمے میں جایا نہیں جاتا
            تھام كے دِل رونے لگے یوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین
            ساتھ قدم آگے بھڑہے کیوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین

            {'\n\n'}ہائے قدم پانچوا ( 5 ) اُٹھا
            رو کے یہ کہنے لگے مولا
            ہائے بہرے مدد آئیے بابا
            بھری ہے خیبر سے یہ لاشہ
            تھام كے دِل رونے لگے یوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین
            ساتھ قدم آگے بھڑہے کیوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین

            {'\n\n'}ہائے پاؤ چھٹی ( 6 ) بار بڑھایا
            اتنے میں خود آگئیں زہرہ
            ہائے بولی کے اب تو نہیں تنہا
            دے مجھے بیشیر کا لاشہ
            تھام كے دِل رونے لگے یوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین
            ساتھ قدم آگے بھڑہے کیوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین

            {'\n\n'}ساتوی ( 7 ) باری میں ہُوا کیا
            دَر پہ چلی ائی سكینہ
            ہائے کہنے لگی آگے بابا
            ہے کہاں ناننا میرا بھئیا
            تھام كے دِل رونے لگے یوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین
            ساتھ قدم آگے بہری کیوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین

            {'\n\n'}خیام میں فرحان ہُوا کیا
            ظلِ رضا لکھ نہیں پایا
            ہائے لاشہ جوں ہی ماں کو دکھایا
            ایک قیامت ہوئی برپا
            تھام كے دِل رونے لگے یوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین
            ساتھ قدم آگے بھڑہے کیوں حسین
            ساتھ قدم پیچھے ہٹے کیوں حسین{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default SaatQadam;
