import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const Sadarahay = () => {
  return (
    <View>
      <Text style={styles.text}>
            فنا ہوجائے گی دُنیا
            لیکن خدا کا ہے وعدہ
            جب تک یہ عزا رہے گی
            زہرہ کی دعا رہے گی

            {'\n\n'}نا تم رہو گے نا ہم رہیں گے
            سُن لے یہ سارا زمانہ
            عزا رہے گی عزا رہے گی
            سدا رہے گا حسین حسین
            حسین حسین مولا حسین حسین

            {'\n\n'}زندہ باد زندہ باد شاہ کی عزا زندہ باد
            عزا رہے گی عزا رہے گی
            سدا رہے گا حسین حسین

            {'\n\n'}شبیر کا غم رہے گا سدا
            ناسلو کو ویرسے میں دے دی عزا
            کل ہم رہیں نا رہیں کیا پتہ
            زکرِ اذا ، آہو بکا
            یہ سوچ کر ، کرنا سدا
            نا تم رہو گے نا ہم رہیں گے
            سُن لے یہ سارا زمانہ
            عزا رہے گی عزا رہے گی
            سدا رہے گا حسین حسین
            حسین حسین مولا حسین حسین

            {'\n\n'}ہم ہیں دعاِ سعیدہ
            ہم ہیں فداِ حسین
            زندہ باد زندہ باد شاہ کی عزا زندہ باد
            عزا رہے گی عزا رہے گی
            سدا رہے گا حسین حسین
            حسین حسین مولا حسین حسین

            {'\n\n'}نکلے گھروں سے سبھی نوحہ گر
            پیدل جولوسو میں کرنے سفر
            نا فقرِ موسم نا دشمن کاڈر
            اُونچے علم ، بڑتے قدم
            روکے ہمیں ، کس میں ہے دم
            نا تم رہو گے نا ہم رہیں گے
            سُن لے یہ سارا زمانہ
            عزا رہے گی عزا رہے گی
            سدا رہے گا حسین حسین
            حسین حسین مولا حسین حسین

            {'\n\n'}سینے میں دِل دِل میں ہے دھڑکن
            دھڑکن میں حسین
            آنکھوں میں اشکوں کا ہے ساون
            ساون میں حسین
            مگا ہے اللہ سے جیون
            جیون میں حسین
            کربوبلا ہے میرا مسکن
            مسکن میں حسین

            {'\n\n'}تم بھی کرو ہم بھی کریں ، ماتمِ حسین
            تم بھی پڑھو ہم بھی پڑھیں ، مجلسِ حسین
            تم بھی بنو ہم بھی بنائیں ، زائیرِ حسین
            تم بھی چلو ہم بھی چلیں ، مقتلِ حسین

            {'\n\n'}تم بھی اٹھاؤ الم ، ہم بھی اُٹھے الم
            تم بھی بڑھاؤ قدم ، ہم بھی بڑھے قدم
            تم بھی یہ کھاؤ قسم ، ہم بھی یہ کہیں قسم
            تم بھی مناوگے غم ، ہم بھی منایں گے غم
            نا تم رہو گے نا ہم رہیں گے
            سُن لے یہ سارا زمانہ
            عزا رہے گی عزا رہے گی
            سدا رہے گا حسین حسین
            حسین حسین مولا حسین حسین

            {'\n\n'}رسم وفا یوں نبھاتے ہیں ہم
            بچو کو ساققا بناتے ہیں ہم
            تہذیب مجلس سکھاتے ہیں ہم
            نوحہ پڑھو ، ماتم کرو
            ہم نے کیا ، تم بھی کرو
            نا تم رہو گے نا ہم رہیں گے
            سُن لے یہ سارا زمانہ
            عزا رہے گی عزا رہے گی
            سدا رہے گا حسین حسین
            حسین حسین مولا حسین حسین

            {'\n\n'}ذکر عزا کو اور بڑھاؤ
            ناسلو کو یوں پروان چڑھاؤ
            ماتمی اور نمازی بناؤ
            جو کیا تم نے انہیں بھی سکھاؤ
            گزریں جہاں سےجلوس عزا كے
            رہو میں اُن کے سابیلایں لگاؤ

            {'\n\n'}یہ ہیں سابیلایں یہ پیاسو کا ماتم
            رہو میں ہے یہ اسییرو کا ماتم
            یہ خون کا پُرْسَہ یہ زخموں کا ماتم
            شولو پہ عابد كے چھالو کا ماتم
            ذکر سكینہ تامانچو کا ماتم
            ہوتا رہیگا شہیدوں کا ماتم
            نا تم رہو گے نا ہم رہیں گے
            سُن لے یہ سارا زمانہ
            عزا رہے گی عزا رہے گی
            سدا رہے گا حسین حسین

            {'\n\n'}ہر سانس پر قرض ہے شاہ کا غم
            جتنا بھی ماتم کریں وہ ہے کم
            فرشِ عزا پر نِکل جائے دم
            جتنی بچی ، ہے زندگی
            کرتے رہیں ، یہ نوکری
            نا تم رہو گے نا ہم رہیں گے
            سُن لے یہ سارا زمانہ
            عزا رہے گی عزا رہے گی
            سدا رہے گا حسین حسین
            حسین حسین مولا حسین حسین

            {'\n\n'}موت كے سیلاب میں
            ہر خوشک و تر بہہ جائے گا
            ہاں مگر نام حسین اِبْن علی راہ جائے گا
            نا تم رہو گے نا ہم رہیں گے
            سُن لے یہ سارا زمانہ
            عزا رہے گی عزا رہے گی
            سدا رہے گا حسین حسین
            حسین حسین مولا حسین حسین

            {'\n\n'}بی بی کی محنت یہ رنگ لائی ہے
            ماتم کا ہر کوئی شیدائ ہے
            ایہلِ عزا نے قسم کھائی ہے
            یہ دِل ہے کیا ، یہ جان ہے کیا
            شبیر پر ، سب کچھ فدا
            نا تم رہو گے نا ہم رہیں گے
            سُن لے یہ سارا زمانہ
            عزا رہے گی عزا رہے گی
            سدا رہے گا حسین حسین

            {'\n\n'}ہم نا کبھی بھولیں گے یہ غم
            مولا کی قسم
            نوحہ پڑہیگیں یونہی ہر دم
            مولا کی قسم
            رکنے نہیں دیں گے یہ ماتم
            مولا کی قسم
            جھکنے نہیں دیں گے یہ پرچم
            مولا کی قسم

            {'\n\n'}ایہل عزا آؤ ماتم کریں ہم
            محوےبوکا آؤ ماتم کریں ہم
            سادات کا آؤ ماتم کریں ہم
            غم ہے بڑا آؤ ماتم کریں ہم
            گونجے سدا آؤ ماتم کریں ہم
            بس ہر جگہ آؤ ماتم کریں ہم
            نا تم رہو گے نا ہم رہیں گے
            سُن لے یہ سارا زمانہ
            عزا رہے گی عزا رہے گی
            سدا رہے گا حسین حسین
            حسین حسین مولا حسین حسین

            {'\n\n'}یہ تیرا ماتم یہ نوحے رہیں گے
            فرحان و مظہر یہ کہتے رہیں گے
            نسلو کو پیغام دیتے رہیں گے
            یونہی چراغ عزا بھی جلیں گے
            نا یہ قدم رک سکے نا روکیں گے
            مجلس کی جانب یہ برتے رہیں گے
            نا تم رہو گے نا ہم رہیں گے
            سُن لے یہ سارا زمانہ
            عزا رہے گی عزا رہے گی
            سدا رہے گا حسین حسین
            حسین حسین مولا حسین حسین{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default Sadarahay;
