import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const ShameGareeban = () => {
  return (
    <View>
      <Text style={styles.text}>
            صحرا تپتا صحرا
            جلتے خیمے بکھرے لاشے
            دے رہے ہیں یہ لاشے دوحئی

            {'\n\n'}جل گئے خیام چھِن گئی چادر
            مرے گئے سب بھائی
            خیمو کا پہرہ دیتی ہے
            زینب اور تنہائی
            شامِ غریباں آئی

            {'\n\n'}آگ لیے جب آگیا لشکر
            چھین لی چادر پھونک دیا گھر
            جلنے لگا بیمار کا بستر
            اُس پے غشی ہے چھائی
            عابد کو شولو سے اٹھا کر
            پشت پہ زینب لائی
            شامِ غریباں آئی

            {'\n\n'}بچو کو زینب نے جو دیکھا
            ان میں نہیں تھی بالی سكینہ
            گھبرا کر غازی کو سدا دی
            رُو كے بہن چلائی
            پاس تمھارے بالی سكینہ
            آئی ہے کیا بھائی
            شامِ غریباں آئی

            {'\n\n'}اجڑا گھر ہے اِس كے حوالے
            اک زینب کس کس کو سنبھالے
            ساحمے بچے اُجڑی مایی
            ہر بی بی گھبرائی
            زینب نے سادات کو دیکھا
            نادِ علی دہرائی
            شامِ غریباں آئی

            {'\n\n'}کون بڑھا یہ جانبِ خیمہ
            غیض میں زینب نے للکارا
            آنے والے لوٹ جا واپس
            دیتی ہوں میں دہائی
            اب کیا لوٹ نے آیا ہے تو
            لٹ گئی ساری کمائی
            شامِ غریباں آئی

            {'\n\n'}اُلٹی نقاب اور بولے حیدر
            بابا علی ہوں اے میری دختر
            لگ جا گلے جی کھول كے رو لے
            تو ہے غموں کی ستئی
            پِھر تو اتنا روئی زینب
            خود کو روک نا پائی
            شامِ غریباں آئی

            {'\n\n'}ایسا تھا پر درد وہ منظر
            کیسے کہیں فرحان اور مظہر
            بولی زینب باپ سے رو کر
            دیکھو ذرا تنہائی
            میں اک زندہ لاش ہوں بابا
            مجھ کو موت نا آئی
            شامِ غریباں آئی{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default ShameGareeban;
