import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const UjarGaye = () => {
  return (
    <View>
      <Text style={styles.text}>
        وسدا گھر برباد ہویا
        آباد ہوئی اے کربوبلا
        واویلا صد واویلا

        {'\n\n'}ہائے اُجڑ گئی آج ثانیِ ظہرہ
        وچ کربل دے واویلا
        واویلا صد واویلا

        {'\n\n'}خیمیا دے وچ اگ لگ گئی
        ہائے زینب ہوگئی باج ردا
        واویلا صد واویلا
        ہائے اُجڑ گئی آج ثانیِ ظہرہ
        وچ کربل دے واویلا
        واویلا صد واویلا

        {'\n\n'}ڈول گیا پانی کٹ گئیاں باواں
        آپ تھکی نا تکدی راواں
        بن پانی مک چالیاں ساواں
        پیاسے رہ گئے بہن بھیرا
        واویلا صد واویلا
        ہائے اُجڑ گئی آج ثانیِ ظہرہ
        وچ کربل دے واویلا
        واویلا صد واویلا

        {'\n\n'}آج ویران عباس جے ہوندا
        کیڑا سی جیڑا چادراں کھوندا
        دِل زینب دا رت پیا روندا
        ظالم خوف خدا دا کھا
        واویلا صد واویلا
        ہائے اُجڑ گئی آج ثانیِ ظہرہ
        وچ کربل دے واویلا
        واویلا صد واویلا

        {'\n\n'}ویرنوں پوری نیندر آئی
        چوم چوم آ کھیں امڑی جائے
        تیر نے تیری پیاس بھوجھائی
        اصغر اکھیاں کھول ذرا
        واویلا صد واویلا
        ہائے اُجڑ گئی آج ثانیِ ظہرہ
        وچ کربل دے واویلا
        واویلا صد واویلا

        {'\n\n'}پیاسے گلے وچ تیر پرویا
        جھولا تیرا خالی ہویا
        عرش وی رویا فرش وی رویا
        ماں نے کی تا شکر ادا
        واویلا صد واویلا
        ہائے اُجڑ گئی آج ثانیِ ظہرہ
        وچ کربل دے واویلا
        واویلا صد واویلا

        {'\n\n'}قاسم دی جانج کربل آئی
        ظالماں خوں دی مہندی لائی
        لٹ لائی پیر حسن دی کمائی
        ڈول گیا ہر پھل سہرے دا
        واویلا صد واویلا
        ہائے اُجڑ گئی آج ثانیِ ظہرہ
        وچ کربل دے واویلا
        واویلا صد واویلا

        {'\n\n'}مارن والا لشکر آیا
        ظالماں کیتا پارا پارا
        باغ نبی دا اُجڑھیا سارا
        وس گئی اے آج کربوبلا
        واویلا صد واویلا
        ہائے اُجڑ گئی آج ثانیِ ظہرہ
        وچ کربل دے واویلا
        واویلا صد واویلا

        {'\n\n'}قیدن ہوئی معصوم سكینہ
        رون نا دے وے شمر کدی نا
        یاد آوے بابل دا سینہ
        آ ویرن گل دے نال لا
        واویلا صد واویلا
        ہائے اُجڑ گئی آج ثانیِ ظہرہ
        وچ کربل دے واویلا
        واویلا صد واویلا{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default UjarGaye;
