import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const ZainabZainab = () => {
  return (
    <View>
      <Text style={styles.text}>
            زینب زینب زینب ، زینب زینب زینب
            دریا پے مارا گیا تیرا علمدار زینب
            زینب زینب زینب ، زینب زینب زینب

            {'\n\n'}ہاتھوں میں کوزا لیے بیٹھے ہیں پیاسے
            ہے سب کو آس زینب اس باوفا سے
            منہ ہم سے مور گیا غربت میں چوڑ گیا
            دِل میرا کہتا ہے اب جینا ہے بیکار زینب
            زینب زینب زینب ، زینب زینب زینب
            دریا پے مارا گیا تیرا علمدار زینب
            زینب زینب زینب ، زینب زینب زینب

            {'\n\n'}کہتی تھی میری بچی آئیگا پانی
            اسکو سنا دو زینب غم کی کہانی
            مارا گیا سکا کنبہ رہا پیاسا
            پیاسو ں پے ہو گیا قربان وہ سالار زینب
            زینب زینب زینب ، زینب زینب زینب
            دریا پے مارا گیا تیرا علمدار زینب
            زینب زینب زینب ، زینب زینب زینب

            {'\n\n'}مشک سكینہ چھییدی کٹ گے شانے
            کیسے زمین پر آیا اللہ ہی جانے
            گورز تھا سَر پے لگا آنکھ میں تیر بھی تھا
            اٹھنا چاہا تو نا اٹھ پایا وہ جرار زینب
            زینب زینب زینب ، زینب زینب زینب
            دریا پے مارا گیا تیرا علمدار زینب
            زینب زینب زینب ، زینب زینب زینب

            {'\n\n'}دریا پے جب میں پوہنچھا لاشہ اُٹھانے
            کی تھی مجھ سے وصیت اس باوفا نے
            لاشہ خایموں میں میرا ، آقا لے کر نا جانا
            یہ کہہ کے چھوڑ گیا مجھ کو وفادار زینب
            زینب زینب زینب ، زینب زینب زینب
            دریا پے مارا گیا تیرا علمدار زینب
            زینب زینب زینب ، زینب زینب زینب

            {'\n\n'}مجھ پے چلے گا خنجر خیمے جالینگے
            چادر چھینے گی تیری بازو بند یں ینگے
            سب کا غم خار ہو گا میرا بیمار ہو گا
            اب تک عباس تھا اب تو ہی ہے سالار زینب
            زینب زینب زینب ، زینب زینب زینب
            دریا پے مارا گیا تیرا علمدار زینب
            زینب زینب زینب ، زینب زینب زینب

            {'\n\n'}مولا کا نوحہ تھا یہ فرحان و مظہر
            فرش اذا بیچھاو اے میری خواہر
            آؤ اب زیر علم برپا کریں ماتم
            ہم ہیں اس باوفا کے پہلے عزا دار زینب
            زینب زینب زینب ، زینب زینب زینب
            دریا پے مارا گیا تیرا علمدار زینب
            زینب زینب زینب ، زینب زینب زینب{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default ZainabZainab;
