import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const Abalfazl = () => {
  return (
    <View>
      <Text style={styles.text}>
        عباس عباس عباس{'\n'}
        ابالفضل ابالفضل ابالفضل علمدار{'\n'}
        ساققیے آلے اّبا ابالفضل{'\n'}
        تشنہ لابے کربلا ابالفضل{'\n'}
        چیشمائےآبے بقا ا ابالفضل{'\n'}
        یا ابالفضل یا ابالفضل یا ابالفضل یا ابالفضل{'\n'}
        ابالفضل یا ابالفضل یا ابالفضل
        {'\n\n'}کرب شبیر كے چہرے سے مٹانے والے رنج سے آلے محمد کو چھوڑ انے والے
        تھام لے ہاتھ پریشان آزاداروں کا ائے سكینہ كے لیے بازو کٹانے والے ابالفضل
        یا ابالفضل یا ابالفضل
        {'\n\n'}ٹوٹ جائے نا میری آس ہے امیدے حرام میرے زخموں کا فقط آپ ہو غازی
        مرہم اربائین پہ ہمیں بولوالیں زیارت كے لیے آپ کو پہلو شکستہ کسی بی بی کی
        قسم ابالفضل یا ابالفضل یا ابالفضل
        {'\n\n'}ہم کو دنیا کا طرفدار نا ہونے دے نا صرف باتوں کا آزا دار نا ہونے
        دے نا صدقہ شہزادی روقیا كے بھاندے ہاتھو کا ہم کو مشکل میں گرفتار نا ہونے
        دے نا ابالفضل یا ابالفضل یا ابالفضل
        {'\n\n'}لیخدو تقدیر میں ِپھر کربلا جانا غازی اپنا دربار ہمیں جلد دکھانا
        غازی واسطہ دیتا ہو زخمی علی اکبر کا تمیں کربلا سارے جاوانو کو بولانا
        غازی ابالفضل یا ابالفضل یا ابالفضل{'\n\n'} اس گھڑی نظروں میں آشور کی رو
        یاد آئی آنسو آکھو میں بھرے ہونٹوں پہ فریاد آئی سامنے پانی تھا اور پی بھی
        نہیں سکتا تھا مجھ کو روزےمیں تیری پیاس بہت یاد آئی ابالفضل یا ابالفضل یا
        ابالفضل{'\n\n'}تم ہو شبیر کی بیٹی کا سہارا غازی س کا گزارا غازی ُ بن
        تمہارے نا ُہوا ا شمر نے جب بھی سكینہ کو تاماچے مرے س نے بابا کو نہیں تم
        کو ُپکارا غازی ُ ا ابالفضل یا ابالفضل یا ابالفضل {'\n\n'} اس گھڑی خیمائے
        سادات میں کہرام ُہوا خون بھرا جس گھڑی رن سے تیرا پرچم آیا پییاسی مر
        جائوگی اور پانی نہیں ماگو گی توڑ کر قوزے یہ معصوم سكینہ نے کہا ابالفضل
        یا ابالفضل یا ابالفضل{'\n\n'}
        تم نے اچھا ُہوا بھائی کی نا غربت دیکھی تانے دیتا تھا کوئی شاہ پہ ہنستا
        تھا کوئی اپنے بھائی کی مدد كے لیے رن میں آ کر ٹھائی ہے علی اکبر کی ُ لاش
        زینب نے ا{'\n\n'}
        شاہ نے رو کر کہا ابالفضل{'\n'}
        ٹھو میرے باوفا ابالفضل{'\n'}ُ ا تنہا ہے بھائی تیرا ابالفضل{'\n'}
        ابالفضل ابالفضل ابالفضل علمدار{'\n\n'}آخری لمحوں میں شبیر بہت پیاسے تھے
        بڑی حسرت سے سووے نیہر نظر کرتے تھے شمر ہس ہس كے لگاتا رہا 13 زربیں اور
        ہر وار پہ شبیر سدا دے تے تھے ابالفضل یا ابالفضل یا ابالفضل
        {'\n\n'}میر سجاد بیا کیسے کرے وہ منظر شام کی فوج میں جب آگ لگائی آ کر دا
        زینب کیِ َسر سے ر چھیننے آ گئے جبس گھڑی کیہتی رہی ثانیِ زاہرا رو کر
        {'\n\n'}ُ ا ابالفضل ابالفضل ابالفضل علمدار{'\n'}
        عباس{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default Abalfazl;
