import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const Bekasi = () => {
  return (
    <View>
      <Text style={styles.text}>
            بیکسی کا شہہ کی چرچا رہ گیا

            {'\n\n'}بیکسی کا شہہ کی چرچا رہ گیا
            مجرئ مہمان پیاسا رہ گیا
            بیکسی کا شہہ کی چرچا رہ گیا

            {'\n\n'}سب ہوئے سیراب تجھ سے اے فرات
            کافلا یژرب کا پییاسا رہ گیا
            مجرئ مہمان پیاسا رہ گیا
            بیکسی کا شہہ کی چرچا رہ گیا

            {'\n\n'}ظہر تک جب فوج پوہنچی خلد میں
            صاحبِ لشکر اکیلا رہ گیا
            مجرئ مہمان پیاسا رہ گیا
            بیکسی کا شہہ کی چرچا رہ گیا

            {'\n\n'}اِس قدر تھا خشک حضرت کا گلا
            خنجرِ قاتل بھی پیاسا رہ گیا
            مجرئ مہمان پیاسا رہ گیا
            بیکسی کا شہہ کی چرچا رہ گیا

            {'\n\n'}ڈگمگا کر جب گرے گھوڑے شاہ
            کانپ کر عرشِ معلی رہ گیا
            مجرئ مہمان پیاسا رہ گیا
            بیکسی کا شہہ کی چرچا رہ گیا

            {'\n\n'}کہتی تھی ماں سوئے اصغر قبر میں
            ہائے خالی اُن کا جھولا رہ گیا
            مجرئ مہمان پیاسا رہ گیا
            بیکسی کا شہہ کی چرچا رہ گیا

            {'\n\n'}زخم کھا تے ہی جو اکبر گر پڑے
            چد كے برچھی میں کلیجہ رہ گیا
            مجرئ مہمان پیاسا رہ گیا
            بیکسی کا شہہ کی چرچا رہ گیا

            {'\n\n'}جب ہوئی بے پردہ اولادِ رسول
            پِھر جہاں میں کس کا پردہ رہ گیا
            مجرئ مہمان پیاسا رہ گیا
            بیکسی کا شہہ کی چرچا رہ گیا{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default Bekasi;
