import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const Bhaikalasha = () => {
  return (
    <View>
      <Text style={styles.text}>
        ارے دشمن کو بھی نا بھائی ماتم خدا دکھائے
        {'\n'}لوگوں بتاؤ بھائی کو بھائی کہاں سے لائے
        {'\n'}بھائی کو خدا بھائی کا لاشا نہ دکھائے

        {'\n\n'}لاشے پہ علمدار كے شہہ کہتے تھے ہائے
        {'\n'}بھائی کو خدا بھائی کا لاشا نہ دکھائے

        {'\n\n'}کیا ثانئ زہرہ میں بتلاؤں گا بھئیا
        میں لاش سے اٹھ کر تو نہیں جاؤں گا
        اب شیمر یہی آ كے چھوری مجھ پہ چلے
        بھائی کو خدا بھائی کا لاشا نہ دکھائے

        {'\n\n'}پھٹ جائے گا غم سے میرا ِدل تھم لو عباس
        اب دیر بہت ہو گئی گھر کو چلو عباس
        ایسا نا ہو مقتل میں سكینہ چلی آئے
        بھائی کو خدا بھائی کا لاشا نہ دکھائے

        {'\n\n'}اب ہاتھوں میں لرزاں ہے کہا جان رہی ہے
        مظلوم کی غربت میں کمر ٹوٹ گئی ہے
        یا رب کسی دشمن پہ بھی یہ وقت نا آئے

        {'\n\n'}ہو گئے مرنا ستم عباس کا
        {'\n'}عباس پانی لاؤ عباس پانی لاؤ

        {'\n\n'}ہاتھوں میں خالی کوزے بچیں لیے ہوئے ہیں
        گردے سكینہ دیکھو ہلکا کیے ہوئے ہیں
        بچے نا جانے کب کا پانی پیئے ہوئے ہے
        بن آب مر نا جائیں پانی انہیں پلاؤ
        عباس عباس پانی لاؤ عباس پانی لاؤ
        بھائی کو خدا بھائی کا لاشا نہ دکھائے

        {'\n\n'}پہلو میں سدا میں نے بٹھایا تمہیں بھائی
        ودی اٹھایا تمہیں بھائی
        جس بھائی نے گُ
        وہ بھائی بھلا کیسے تیری لاش اٹھائے
        بھائی کو خدا بھائی کا لاشا نہ دکھائے
        ہم شکل پیعمبر كے حوالے

        {'\n\n'}ماں بہنے ہیں
        میں مشک و علم کرتا ہوناکبر كے حوالے
        ہمت نہیں شبیر میں جو خیموں میں جائے
        بھائی کو خدا بھائی کا لاشا نہ دکھائے

        {'\n\n'}سادات ہے یہ شام كے لشکر کو بتاؤ
        جاتے ہوئے یہ شمر سے کہتے ہوئے جاؤ     
        وہ میری سكینہ کو تامچے نا لگائے

        {'\n\n'}ٹوٹ گئی آس میری ٹوٹ گئی آس
        
        {'\n\n'}دیر ہوئی میرے چچا جان سیدھاریں  
        اکبر و بابا ہیں گئے نہار کنارے      
        آر اماں میرا قلب جلا پیاس كے مرے
        ٹوٹ تے جاتیں ہیں میرے ِدل كے سہارے
        ٹوٹ گئی آس میری ٹوٹ گئی آس
        بھائی کو خدا بھائی کا لاشا نہ دکھائے

        {'\n\n'}اکبر کو ابھی جانے دو َہم نے تو کہا تھا
        اولاد تو مل جاتی ہے بھائی نہیں ملتا
        شبر کہاں سے تمہیں ڈھونڈ كے لائے
        بھائی کو خدا بھائی کا لاشا نہ دکھائے
 
        {'\n\n'}سادات یہ کہتے ہیں
        َہم پایسی رہیں گے
        تم نے نا پیا پانی تو َہم بھی نا پیایں گے     
        ہمیں پیاسا ہی دنیا سے اٹھائے
        بھائی کو خدا بھائی کا لاشا نہ دکھائے    

        {'\n\n'}مڑ مڑ كے تکے جاتے تھے عباس کا لاشا
        گرتے کبھی اٹھتے تھے تعکلم شہِہ والا  
        اکبر بڑی مشکل سے سنبھالے ہوئے آئے
        بھائی کو خدا بھائی کا لاشا نہ دکھائے{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default Bhaikalasha;
