import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const MaheMuharram = () => {
  return (
    <View>
      <Text style={styles.text}>
            صغرا کو محرم کا جب چند نظر آیا
            یا دِ شہہِ مولا نے دِل اور بھی تڑپایا

            {'\n\n'}چاند کو دیکھ كے صغرا نے کہا ہائے حُسین

            {'\n\n'}آگیا ماہِ محرم ہاں نہیں آئے حسین
            چاند کو دیکھ كے صغرا نے کہا ہائے حُسین

            {'\n\n'}یاد پَردیس میں آتی ہے لحد اماں کی
            گھر کا احوال سنانے کو کہا جائے حسین
            چاند کو دیکھ كے صغرا نے کہا ہائے حُسین

            {'\n\n'}آپ آئے نا خبر آئی نا اکبر نا آئے
            آرے کیسے اِس حال میں صغرا سے جیا جائے حسین
            چاند کو دیکھ كے صغرا نے کہا ہائے حُسین

            {'\n\n'}جب سے یہ چاند محرم کا نظر آیا ہے
            اماں روتی ہے تجیھ ائے میرے ماں جائے حسین
            چاند کو دیکھ كے صغرا نے کہا ہائے حُسین

            {'\n\n'}کوئی تاسویر تو زاہرہ کی رہی پردے میں
            ہائے یہ تو اچھا ہُوا صغرا کو نہیں لائے حسین
            چاند کو دیکھ كے صغرا نے کہا ہائے حُسین

            {'\n\n'}نام پر شاہ نے اکبر كے خریدی ہے زمین
            کیسے جاگیر تجھے بھائی کی دکھلائے حسین
            چاند کو دیکھ كے صغرا نے کہا ہائے حُسین

            {'\n\n'}عید بھی سوگ كے عالم میں گزاری اُس نے
            ہائے اکبر کبھی کہتی تھی کبھی ہائے حسین
            چاند کو دیکھ كے صغرا نے کہا ہائے حُسین

            {'\n\n'}ہائے مستقل شاہ كی آنکھوں سے تھے آنسو جاری
            خِط صغرا کو مکمل نہیں پڑھ پائے حسین
            چاند کو دیکھ كے صغرا نے کہا ہائے حُسین

            {'\n\n'}ہائے اک اک بیٹی سے رخصت ہوئے خیمے میں مگر
            ہائے افسوس كے صغرا سے نا مل پائے حسین
            چاند کو دیکھ كے صغرا نے کہا ہائے حُسین

            {'\n\n'}لکھ كے نوحہ یہ تعکلم نے دعا مگی ہے
            ہر عز ا دار کو آشور پہ بلوائے حسین
            چاند کو دیکھ كے صغرا نے کہا ہائے حُسین{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default MaheMuharram;
