import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const MolaRotay = () => {
  return (
    <View>
      <Text style={styles.text}>
            إنا لله و إنا إليه راجعون

            {'\n\n'}زینب کا چہرہ دیکھتے ہیں اور مولا روتے جاتے ہیں

            {'\n\n'}عباس کے آنسو پوچتے ہیں شبیر کو پچھ سمجھاتے ہیں
            اور مولا روتے جاتے ہیں
            زینب کا چہرہ دیکھتے ہیں اور مولا روتے جاتے ہیں

            {'\n\n'}سر دیکھ کہ زخمی بابا کا جب بیٹیاں رونے لگتی ہے
            بچوں کو تسلی کی خاطر زہرا کا درد سناتے ہیں
            اور مولا روتے جاتے ہیں
            زینب کا چہرہ دیکھتے ہیں اور مولا روتے جاتے ہیں

            {'\n\n'}زخمی مولا کی آنکھوں میں زخمی مشکیزہ پھرتا ہے
            عباس جڑی کے ہاتھوں سے قاتل کو جام پلاتے ہیں
            اور مولا روتے جاتے ہیں
            زینب کا چہرہ دیکھتے ہیں اور مولا روتے جاتے ہیں

            {'\n\n'}ہائے
            پھرتا ہے نگاہوں میں منظر بازاروں کا درباروں کا
            کچھ دیر کو گھر کہ آگن میں زینب کو ساتھ چلاتے ہیں
            اور مولا روتے جاتے ہیں
            زینب کا چہرہ دیکھتے ہیں اور مولا روتے جاتے ہیں

            {'\n\n'}اک روز شی کوفے میں تمہیں بے پردہ حرم کو لعنہ ہے
            عابد کو لگا کر سینے سے بازار کا حال سناتے ہیں
            اور مولا روتے جاتے ہیں
            زینب کا چہرہ دیکھتے ہیں اور مولا روتے جاتے ہیں

            {'\n\n'}بھائی کے ساتھ میری زینب جائے گی جہاں جانے دینا
            یہ تم کو وصیت ہے میری اب درّہ سے فرماتے ہیں
            اور مولا روتے جاتے ہیں
            زینب کا چہرہ دیکھتے ہیں اور مولا روتے جاتے ہیں

            {'\n\n'}سادات کہ رونے کی جو صدا بردے سے باہر آتی ہے
            پہچان لو ان آوازوں کو لوگوں سے کہتے جاتے ہیں
            اور مولا روتے جاتے ہیں
            زینب کا چہرہ دیکھتے ہیں اور مولا روتے جاتے ہیں

            {'\n\n'}ہائے
            معلوم تھا اک دن شانوں میں زینب کے رسن بند جائے گی
            شبر سے کہہ کے قاتل کے ہاتھوں سے رسن کلواتے ہیں
            اور مولا روتے جاتے ہیں
            زینب کا چہرہ دیکھتے ہیں اور مولا روتے جاتے ہیں

            {'\n\n'}جب نازک ہچکی آتی ہے زینب پہ نظر رک جاتی ہے
            اللہ تجھے آباد رکھے ہونٹوں سے دعا فرماتے ہیں
            اور مولا روتے جاتے ہیں
            زینب کا چہرہ دیکھتے ہیں اور مولا روتے جاتے ہیں

            {'\n\n'}پوچھا ہے تکلم زینب نے حیدر سے یہ آخری سانسوں میں
            کیوں بازو دیکھے جاتے ہیں کیوں سر کو چومے جاتے ہیں
            اور مولا روتے جاتے ہیں
            زینب کا چہرہ دیکھتے ہیں اور مولا روتے جاتے ہیں{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default MolaRotay;
