import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const ShimrKanjar = () => {
  return (
    <View>
      <Text style={styles.text}>
            ہائے حسین ، ہائے حسین

            {'\n\n'}شمر نے گردنِ مظلوم پہ خنجر جو رکھا
            کچھ قدم دور سے دیتی رہی زینب یہ سدا
            آخری بار بہن چوم لے بھائی کا گلا
            شمر خنجر نا چلا

            {'\n\n'}جوڑ کر ہاتھ یہ کہتی رہی بنتِ زہراؑ
            شمر خنجر نا چلا
            آخری بار بہن چوم لے بھائی کا گلا
            شمر خنجر نا چلا

            {'\n\n'}تیر جی بھر كے اِسے مار چکا ہے لشکر
            بارچِھیاں پہلو میں ٹوٹی ہیں ستم اور نا کر
            خود ہی آ جائے گی کچھ دیر میں بھائی کو قضا
            شمر خنجر نا چلا
            آخری بار بہن چوم لے بھائی کا گلا
            شمر خنجر نا چلا

            {'\n\n'}آخری مجھ سے ملاقات اُوسے کرنی ہے
            ایسا لگتا ہے کوئی بات اُوسے کرنی ہے
            کتنی حسرت سے مجھے دیکھ رہا ہے بھئیا
            شمر خنجر نا چلا
            آخری بار بہن چوم لے بھائی کا گلا
            شمر خنجر نا چلا

            {'\n\n'}مِنطیں کرتی ہوں ظالِم تیری ایسا تو نا کر
            عثر كے وقت میرے گھر میں اندھیرا تو نا کر
            شام سے پہلے بُجھاتا ہے چراغِ زہرہؑ
            شمر خنجر نا چلا
            آخری بار بہن چوم لے بھائی کا گلا
            شمر خنجر نا چلا

            {'\n\n'}یہ دِل و جان رسولِ عربی ہے ظالم
            ساتھ مظلوم كے ، یہ بے اَدَبی ہے ظالم
            مثلِ قرآن ہے یہ زانوں تو سینے سے ہٹا
            شمر خنجر نا چلا
            آخری بار بہن چوم لے بھائی کا گلا
            شمر خنجر نا چلا

            {'\n\n'}سُن كے ہلمِن کی سدا آئی ہے رن میں بچی
            چل نا جائے کہیں دونوں پہ لئیں تیری چُھری
            دیکھ بھائی كے گلے پر ہے سكینہ کا گلا
            شمر خنجر نا چلا
            آخری بار بہن چوم لے بھائی کا گلا
            شمر خنجر نا چلا

            {'\n\n'}کاٹ کر شام ہی لے جانے ہیں سَر تُجھ کو اگر
            پھیر لے آئون و محمد كے گالوں پر خنجر
            میرے بھئیا كے نا کر جسم سے تو سَر کو جدا
            شمر خنجر نا چلا
            آخری بار بہن چوم لے بھائی کا گلا
            شمر خنجر نا چلا

            {'\n\n'}دیکھ سکتا نہیں تو جو نظر آتا ہے مجھے
            واسطہ دیتی ہوں تطہیر کی آیَت کا تجھے
            ہاتھ اماں نے ہے شبیر کی گردن پہ رکھا
            شمر خنجر نا چلا
            آخری بار بہن چوم لے بھائی کا گلا
            شمر خنجر نا چلا

            {'\n\n'}کاٹ کر سجدے میں اکبر شہے والا کا گلا
            شمر ہنستا ہوا شبیر كے سینے سے اُٹھا
            گونجتی راہ گئی مقتل میں یہ زینبؑ کی سدا
            شمر خنجر نا چلا{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default ShimrKanjar;
