import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const ZakhmChupana = () => {
  return (
    <View>
      <Text style={styles.text}>
            بابا میرے بابا
            ہائے اکبر ہائے اکبر ہائے اکبر

            {'\n\n'}اکبر نے سناں کھائی ہے اُن کو نا بتانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا

            {'\n\n'}کس طرح سے دیکھیں گی وہ ہم دونوں کی غربت
            وہ روئ تو آ جائیں گی خاموں میں قیامت
            میں زخم چھپا لیتا ہوں تم آنسو چھپانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا
            اکبر نے سناں کھائی ہے اُن کو نا بتانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا

            {'\n\n'}تصویرِ محمد ہے بڑے نازوں سے پالی
            مر جائے نا خمے میں میری پلنے والی
            ہرگز یہ میرا ہاتھ نا سینے سے ہٹانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا
            اکبر نے سناں کھائی ہے اُن کو نا بتانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا

            {'\n\n'}ماری ہے سناں سینے پہ یہ کہ كے لایں نے
            پھولوں کی طرح پالا ہے اکبر کو پھوپھی نے
            لاشے پہ عبا خیموں سے پہلے ہی اُڑھانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا
            اکبر نے سناں کھائی ہے اُن کو نا بتانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا

            {'\n\n'}اِس بار شہادت کو اٹھا لے گی امامت
            بھائی سے چھپانا نہیں اک بار کی غربت
            سجاد کو تفصیر شہادت کی سنانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا
            اکبر نے سناں کھائی ہے اُن کو نا بتانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا

            {'\n\n'}ممتا انہیں لاشہ پہ میرے لائیگی بابا
            بے ساختہ وہ مجھ سے لپٹ جائیگی گی بابا
            ممکن ہو تو لاشے سے انہیں دور ہٹانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا
            اکبر نے سناں کھائی ہے اُن کو نا بتانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا

            {'\n\n'}جو خاک بھری ہے میرےبالوں سے چھوڑا دو
            چہرے پہ لہو ہے میرے دامن سے ہٹا دو
            وہ ضِد جو زیادہ کرے بس چہرہ دکھانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا
            اکبر نے سناں کھائی ہے اُن کو نا بتانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا

            {'\n\n'}یوں نیزا ستم گار نے مایا میرے بابا
            پہلوں بھی شکستہ ہے ہمارا میرے بابا
            یاد آئے گا دادی کا انہیں زخم پرانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا
            اکبر نے سناں کھائی ہے اُن کو نا بتانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا

            {'\n\n'}اِس حال میں دے صبر خدا بینتِ علی کو
            اکبر کا سلام آخری کہہ دینا پھوپھی کو
            زنداں بڑا مشکل ہے میرے خیمے میں جانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا
            اکبر نے سناں کھائی ہے اُن کو نا بتانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا

            {'\n\n'}ہر بات میری آپ کی بہیموں كے لیے ہے
            بس ایک وصیت میری صغرا كے لیے ہے
            لا کر خط صغرا میرے لاشے پہ سنانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا
            اکبر نے سناں کھائی ہے اُن کو نا بتانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا

            {'\n\n'}دم توڑتے اکبر کو نا پوہنچے کوئی صدمہ
            مہ پھیر كے یوں روتے ہو معلوم ہے بابا
            پر سامنے سادات كے آنسو نا بہانہ
            بابا پھوپھی اماں سے میرا زخم چُھپانا
            اکبر نے سناں کھائی ہے اُن کو نا بتانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا

            {'\n\n'}ہائے اس آخری ہچکی میں تعکلم ہُوا محشر
            اکبر نے کہا ہاتھ جو پیشانی پہ رکھ کر
            لو ہَم کو اِجازَت دو ہمیں دور ہے جانا
            بابا پھوپھی اماں سے میرا زخم چُھپانا{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default ZakhmChupana;
