import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const BusGhazi = () => {
  return (
    <View>
        <Text style={styles.text}>
            لبیک یا عباس

            {'\n'}سخی بادشاہ عباس جئے علما والا
            میرا مرشد غازی

            {'\n'}ہجابِ زینبِ کبریٰ سلام
            سلام یا غازی

            {'\n'}باب الحوائج میرے غازی ہوجا راضی
            سُن لے میری التجا

            {'\n\n'}ہر ماتمی ہلکاِ ماتم میں
            یہ سوچ كے خون بہاتا ہے
            بس غازی ہوجائے راضی
            میرا غازی ہوجائے راضی

            {'\n\n'}یہ دَر ہے سخی عباس کا دَر
            یہاں دیپ وفا كے جلاتے ہیں
            سَر اپنا جھکا لے غم نا کر
            یہاں گرتے لوگ سنبھلتے ہیں
            یہ ورد سجا لے ہونٹوں پر
            دُنیا سے کیں گھبراتا ہے
            بس غازی ہوجائے راضی
            میرا غازی ہوجائے راضی

            {'\n\n'}جو تیرے علم پر آئے گا
            وہ دِل کی مرادیں پائے گا
            تو جس پہ کرم کر دے غازی
            وہ تجھ میں فنا ہو جائے گا
            کشکول تیرے دیوانوں کا
            یہ کہاتے ہی بھر جاتا ہے
            بس غازی ہوجائے راضی
            میرا غازی ہوجائے راضی

            {'\n\n'}سقاِ سكینہ جانے علیؑ
            اک مشک تیرے پرچم سے بندھی
            کہتی ہے عزاداروں سے یہی
            اِس بات پہ شک کرانا نا کبھی
            ملاتا ہے سكینہ کا صدقہ
            اُسکو جو یہ دوہراتا ہے
            بس غازی ہوجائے راضی
            میرا غازی ہوجائے راضی

            {'\n\n'}عباس بُلاتے ہیں جس کو
            بس کربوبلا وہ جاتا ہے
            ہر ایک شہیدِ کربوبلا
            خود اُسکے گلے لگ جاتا ہے
            شبیر کی قبر پہ جا کر جو
            یہ کہ كے پھول چڑھتا ہے
            بس غازی ہوجائے راضی
            میرا غازی ہوجائے راضی

            {'\n\n'}جب ۸ محرم آتی ہے
            اک بی بی یہ فرماتی ہے
            عباس میرے بھائی مجھ کو
            تیری یاد بہت تڑپاتی ہے
            اُٹھتا ہے علم جب غازی کا
            بے ساختہ لب پر آتا ہے
            بس غازی ہوجائے راضی
            میرا غازی ہوجائے راضی

            {'\n\n'}ہُر جاؤن و حبیب اور کیا مُسلم
            کیا آئون و محمد جیسے پِسار
            تو دسویں محرم غور تو کر
            کیا قاسم و اکبر کیا اصغر
            ہر لڑنے والا مقتل میں
            یہ کہ كے تیغ چلاتا ہے
            بس غازی ہوجائے راضی
            میرا غازی ہوجائے راضی

            {'\n\n'}عرفانِ اذا اور اَخْتَر تم
            بس نادِ علی کا ورد کرو
            تم عشیقِ مولا غازی ہو
            یہ سارے زمانے سے کہ دو
            ہَم راہے وفا كے پیاسوں کی
            یہ جملہ پیاس بُجھاتا ہے
            بس غازی ہوجائے راضی{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default BusGhazi 
