import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const HussainJanam = () => {
  return (
    <View>
        <Text style={styles.text}>
            حسین حسین حسین حسین یا حسین
            میرا حسین ہے سب کچھ
            نصیب کچھ بھی نہیں
            سیدزادا حسین ، شہزادا حسین

            {'\n\n'}دلوں کا بادشاہ آیَتِ کبریا حسین
            سلام فرماندہ ، سلام فرماندہ یا حسین
            جانم حسین جانم حسین
            آہ جانم یا حسین
            یا حسین سلام حسین

            {'\n\n'}سلامِ دلبرے زہرہ حسین جان
            سلامِ کعبہِ دلہا حسین جان
            حسین جانم حسین جانم حسین جانم
            حسین جان حسین جان
            حسین جانم حسین جانم حسین جان

            {'\n\n'}آئ شہنشاہِ زمان اخیلے حسن یا مولا
            تیرا دیدار عزادار کی اُلفت کا صِلہ
            اُسکو دُنیا میں سب مِلا حسین جان
            جس نے اک بار بھی کہا حسین جان
            سلامِ کعبہِ دلہا حسین جان
            حسین جان حسین جان
            حسین جانم حسین جانم حسین جان

            {'\n\n'}حسرتِ دِل ہے كے جب کربوبلا جاؤں میں
            سجدہِ شکر کروں خاکِ شفاء لاؤں میں
            یبنا زہرہ حسین قبلہ حسین جان
            بن کے نوکر رہوں ، تیرا حسین جان
            سلامِ کعبہِ دلہا حسین جان
            حسین جان حسین جان
            حسین جانم حسین جانم حسین جان

            {'\n\n'}اک کرم اور میری ذات پہ مولا کردے
            آسمانوں سے بھی آئے جو نظر وہ گھر دے
            جس پے پرچم لگے تیرا حسین جان
            صدقہ غازی کا ہو ، عطا حسین جان
            سلامِ کعبہِ دلہا حسین جان

            {'\n\n'}یا حسین سلام حسین

            {'\n\n'}یاحسین تم انسانیت کے نجات دہندہ ہو
            یہ تم ہی تھے، جس نے ہمیں آزادی کا اصل جوہر سکھایا
            یہ تم ہی تھے، جس نے ہمیں قربانی کا درس دیا
            سب کے بارے میں، یا حسین، یا حسین
            حسین جان حسین جان
            حسین جانم حسین جانم حسین جان

            {'\n\n'}سو گئے نہر پہ عباسِؑ جاری بھی جا کر
            کوئی مونس نا رہا پاس نا کوئی یاور
            رہ گئے دشت میں تنہا حسین جان
            با لابے تھو دلام فدا حسین جان
            سلامِ کعبہِ دلہا حسین جان
            حسین جان حسین جان
            حسین جانم حسین جانم حسین جان

            {'\n\n'}زین سے گر كے زمین پر یہ کہا اکبر نے
            زخمِ دِل آپ سے بابا میں چھوپاوں کیسے
            آکے دیکھو میرا سینا حسین جان
            پیسار یت زخمیئے بیا حسین جان
            سلامِ کعبہِ دلہا حسین جان
            حسین جان حسین جان
            حسین جانم حسین جانم حسین جان

            {'\n\n'}سجدائے شُکر ادا آپ نے مقتل میں کیا
            سورہٰ فجر سے آنے لگی آوازِ خدا
            آجا میری طرف آجا حسین جان
            تجھ سے راضی تیرا خدا حسین جان
            سلامِ کعبہِ دلہا حسین جان
            حسین جان حسین جان
            حسین جانم حسین جانم حسین جان

            {'\n\n'}ممبرِ ناوکِ سینا پر تیرا خطبہ سن کے
            سامنے ماوں كے روتے رہے پیاسے بچے
            قافلہ کہ کے یہ چلا حسین جان
            تویی زیکرام حسین مولا حسین جان
            سلامِ کعبہِ دلہا حسین جان
            حسین جان حسین جان
            حسین جانم حسین جانم حسین جان

            {'\n\n'}اَخْتَر و نادِ علی ہے جسے عرفان اذا
            اُسے راضی ہے قسم رب کی جنابِ زہرہ
            شکریہ دلبرِ زہرہ حسین جان
            شکریہ کعبہِ دلہا حسین
            حسین جنم حسین جنم حسین جان
            یا حسین ، یا حسین ، یا حسین ، یا حسین{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default HussainJanam 
