import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const MatameShabbir = () => {
  return (
    <View>
        <Text style={styles.text}>
            حسین یا حسین مولا حسین یا حسین
            ماتمِ شبیر ، ماتمِ شبیر
            یہ ماتمِ شبیر عزادار کریں گے
            ماتمِ شبیر عزادار کریں گے

            {'\n\n'}دل میں بسا ہے عشقِ حسینی
            عشق کا یوں اظہار کریں گے
            یہ ماتمِ شبیر ، یہ ماتمِ شبیر
            ماتمِ شبیر عزادار کریں گے
            حسین یا حسین مولا حسین یا حسین

            {'\n\n'}شہہ کی اذا پہ ان کا پہرہ یہ ہیں دِل زہرہ کا یقین
            ان کا علم ہے سب سے آگے ان سے آگے کوئی نہیں
            حلقہِ ماتم کی سالاری
            غازی علم بردر کریں گے
            یہ ماتمِ شبیر
            ماتمِ شبیر عزادار کریں گے
            حسین یا حسین مولا حسین یا حسین

            {'\n\n'}قمہ زنی زنجیر زنی سے اپنا خون بہاتے ہیں
            ماتمیوں كے خون كے قطرے ایک دیا بن جاتے ہیں
            اپنے لہو سے یوں ہی اُجالے شاہ كے پرسادار کریں گے
            یہ ماتمِ شبیر
            ماتمِ شبیر عزادار کریں گے
            حسین یا حسین مولا حسین یا حسین

            {'\n\n'}دستِ علی پہ بیعت کی ہے دے گے گواہی عرش و زمین
            ہے میرا رہبر مولا حیدر میرا ولی اور کوئی نہیں
            غیر کی بیعت سے ہر لمحہ آج بھی ہم انکار کریں گے
            یہ ماتمِ شبیر
            ماتمِ شبیر عزادار کریں گے
            حسین یا حسین مولا حسین یا حسین

            {'\n\n'}وہ جو گھٹاتا ہے ممبر پہ آلِ نبی کی عظمت کو
            بھول گیا ہے وہ کوفے میں لشکرِ ظلم کی حالت کو
            دیکھنا اک دن تیرا موقسیر حشر وہی مختار کریں گے
            یہ ماتمِ شبیر
            ماتمِ شبیر عزادار کریں گے
            حسین یا حسین مولا حسین یا حسین

            {'\n\n'}یہ سارے نوحہ خوانِ حسینی ان کو چُونا ہے زہرہ نے
            یہ سارے ذاكر سارے ثناء خواں پڑھتے ہیں اِذْن مولا سے
            تم جو کرو گے ان کی عزت مولا بھی تم سے پیار کریں گے
            یہ ماتمِ شبیر
            ماتمِ شبیر عزادار کریں گے
            حسین یا حسین مولا حسین یا حسین

            {'\n\n'}معجزہ ہے یہ عشقِ علی کا کرتا ہے یہ نسلوں میں سفر
            اِس میں کوئی دو رائے نہیں ہے باپ كے جیسا ہو گا پسار
            ماتمیوں کی آولادوں پر اپنا کرم سرکار کریں گے
            یہ ماتمِ شبیر
            ماتمِ شبیر عزادار کریں گے
            حسین یا حسین مولا حسین یا حسین

            {'\n\n'}اُن کی رضا ہوتی ہے مرضی ملتا ہے تب عرفانِ اذا
            صاحب الم کی جانب سے ہونے تو دو اعلانِ اذا
            سبطِ نبی كے سوگ میں ماتم
            گھر كے دَر و دیوار کریں گے
            یہ ماتمِ شبیر
            ماتمِ شبیر عزادار کریں گے
            حسین یا حسین مولا حسین یا حسین{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default MatameShabbir 
