import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const NaBhoolay= () => {
  return (
    <View>
        <Text style={styles.text}>
            مولا سجادؑ کا نوحہ سُنتے ہی
            اذا خاناِ دِل میں
            ہو گئی مجلس برپا ، ہائے سجادؑ
            ہو گیا ماتم برپا ، ہائے سجادؑ
            ہو گئی مجلس برپا ، ہو گیا ماتم برپا

            {'\n\n'}تاریخِ غمِ سجادؑ میں یہ
            اربابِ ماقاتل نے لکھا
            نومان ابنِ منظر سے یہ
            سجادؑ نے اک دن فرمایا
            آغاز سفر سے آخر تک
            کیا کیا نا ستم گزرے ہَم پر
            ہاں سات مصائب ایسے تھے
            جو سخت ترین ہوئے ہَم پر

            {'\n\n'}سجادؑ کی غربت واویلا
            ہائے وہ قیامت واویلا
            وہ ستم وہ سختیاں
            اور شام کا وہ راسته ، واللہ
            نا بھولے گا سجادؑ
            ہائے شام کا وہ بازار
            نا بھولے گا سجادؑ

            {'\n\n'}تلوار اور نیزوں سے ہَم پر
            وہ حملہ کرتے جاتے تھے
            لوگوں کی بھیڑمیں لاتے تھے
            اور ڈھول و تاول بجواتے تھے
            ہنستے تھے وہ ہَم پر واویلا
            سعدات كے غم پر واویلا
            شام کی راہوں میں جتنا
            سرکشوں نے تڑپایا ، واللہ
            نا بھولے گا سجادؑ
            ہائے شام کا وہ بازار
            نا بھولے گا سجادؑ

            {'\n\n'}عباس اور بابا کا سَر وہ
            پھوپھِیوں كے سامنے رکھتے تھے
            اکبر اور قاسم كے سَر سے
            میرے سامنے شامی کھیلتے تھے
            کہتی تھی سكینہ واویلا
            اے شاہِ مدینہ واویلا
            ہائے شُہدا كے سروں پر
            دوڑنا وہ گھوڑوں کا ، واللہ
            نا بھولے گا سجادؑ
            ہائے شام کا وہ بازار
            نا بھولے گا سجادؑ

            {'\n\n'}اک موڑ پہ شامی لوگوں نے
            جب آگ گھروں سے برسائی
            وہ آگ بجھاتا میں کیسے
            جو میرے امامے پر آئی
            میرے ہاتھ بندھے تھے واویلا
            ہاں سب دیکھ رہے تھے واویلا
            جل گیا میرا امامہ
            جل گیا سَر بھی میرا ، واللہ
            نا بھولے گا سجادؑ
            ہائے شام کا وہ بازار
            نا بھولے گا سجادؑ

            {'\n\n'}وہ سوبہو سے لیکر شام تلک
            گلیوں میں پھراتے تھے ہم کو
            بازار میں سب کے سامنے وہ
            دورے بھی لگاتے تھے ہم کو
            لوگوں کو بُلاکر واویلا
            یہ کہتے تھے ستم گر واویلا
            یہ ہیں باغی ان کو مارو
            وقت تھا ہَم پر کیسا ، واللہ
            نا بھولے گا سجادؑ
            ہائے شام کا وہ بازار
            نا بھولے گا سجادؑ

            {'\n\n'}ہاں کربوبلا سے شام تلک
            ہَم ایک رساں میں جکڑے تھے
            اللہ اللہ ، اہلِ خیبر اور خندک كے
            گھر كے آگے سے جب گزرے
            پھوپھِیوں کا وہ رونا واویلا
            ظالم کا وہ کہنا واویلا
            یہ علی کی بیٹیاں ہیں
            آؤ ان سے لو بدلہ ، واللہ
            نا بھولے گا سجادؑ
            ہائے شام کا وہ بازار
            نا بھولے گا سجادؑ

            {'\n\n'}ہاں اک بازار ایسا بھی تھا
            خودام جہاں پر بیکتے تھے
            افسوس غلاموں کی طرح
            وہ ہم کو بیچنا چاہتے تھے
            ہائے ہائے ہائے
            یہ ہَم کہتے تھے روکر واویلا
            اللہ مدد کر واویلا
            کوئی بھی ایسا نہیں تھا
            جس نے پتھر نا مارا ، واللہ
            نا بھولے گا سجادؑ
            ہائے شام کا وہ بازار
            نا بھولے گا سجادؑ

            {'\n\n'}ذیشانِ اذا عرفانِ اذا
            سجادؑ نے رو کر فرمایا
            ہمیں ایسے پرماکانوں رکھا
            جہاں چھت تھی نا کوئی سایہ تھا
            ہاں دن کی وہ گرمی واویلا
            اور رات کی سردی واویلا
            پیاس کی حالت میں نا پوچھوں
            کتنا مشکل تھا جینا ، واللہ
            نا بھولے گا سجادؑ
            ہائے شام کا وہ بازار
            نا بھولے گا سجادؑ

            {'\n\n'}ہو گئی مجلس برپا ، ہو گیا ماتم برپا{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default NaBhoolay
