import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const QatlGhazika = () => {
  return (
    <View>
        <Text style={styles.text}>
            کس نے مارا علی(ع) کو ہر سُو اداسی چھائی
            ہائے عباس (ع) پہ کیسی یہ قیامت آئی
            خانہِ حق میں یہ غضب ہوگیا
            دیتے ہیں جبریل یہ روکر صدا
            قتل نمازی ہوا

            {'\n\n'}گھر میں زہراؑ کے ماتم بپا ہے
            قتل غازیؑ کا بابا ھوا ھے
            آج کوفے میں محشر بپا ھے
            قتل غازیؑ کا بابا ھوا ھے

            {'\n\n'}ہائےتلوار چلی رب کا ولی زخمی ھوا
            ہر نمازی کے لبوں پر تھی یہی ایک صدا
            واحسرتا ھائے علیؑ وا غربتا
            سر شکستہ ھوا ھائے خون بہنے لگا
            شور مسجد سے یہ اُٹھ رہا ھے
            قتل غازیؑ کا بابا ھوا ھے

            {'\n\n'}جب بھی بابا کے عمامے پہ نظر جاتی ھے
            بس یہ شبیرؑ کے ہونٹوں پہ صدا آتی ھے
            واحسرتا ھائے علیؑ وا غربتا
            یہ یتیمی کا غم ھائے سہہ نا پائینگے ھم
            سنکے یہ بات دل پھٹ رہا ھے
            قتل غازیؑ کا بابا ھوا ھے

            {'\n\n'}اپنی بہنوں کوجو میت سےچھڑاتےہیں حسنؑ
            ہائے افسوس
            گھر سے یہ کہکے جنازے کو اُٹھاتے ہیں حسنؑ
            واحسرتا ھائے علیؑ وا غربتا
            میری بہنوں سنو ھائے الوداع بول دو
            جانتا ہوں یہ صدمہ بڑا ھے
            قتل غازیؑ کا بابا ھوا ھے

            {'\n\n'}باپ کےقدموں میں سررکھکے یہ زینبؑ نےکہا
            ہاتھ اب سر پہ میرے کون رکھے گا بابا
            واحسرتا ھائے علیؑ وا غربتا
            چھوڑ جاؤگے تم ھائے یاد آؤگے تم
            وقت کیسا یہ ہم پہ پڑا ھے
            قتل غازیؑ کا بابا ھوا ھے

            {'\n\n'}جب بھی کوفے میں بقیعہ سے ہوا آتی ھے
            فاطمہ زہراؑ کے رونے کی صدا آتی ھے
            واحسرتا ھائے علیؑ وا غربتا
            ھے مرا دل حزیں ھائے چین ملتا نہیں
            قبر میں جب سے میں نے سنا ھے
            قتل غازیؑ کا بابا ھوا ھے

            {'\n\n'}ھائے ذیشان سے کہتا ہے یہ عرفانِ عزا
            دل سے آجاتی ھے خود روزِ شہادت یہ صدا
            واحسرتا ھائے علیؑ وا غربتا
            ہم نہ بھولے کبھی ھائے زخمِ مولا علیؑ
            آج ھر گھر میں فرشِ عزا ھے
            قتل غازیؑ کا بابا ھوا ھے

            {'\n\n'}بر دشمنِ مولا علی ع لعنت بیشمار
            {'\n'}لعنت بر دشمن علی ع
            {'\n'}لعنت بر دشمن علی ع
            {'\n'}اے قاتل حیدر تیرے کردار پے لعنت
            {'\n'}لعنت بیشمار
            {'\n'}مکار پے اعیار پے غدار پے لعنت
            {'\n'}لعنت بیشمار
            {'\n'}جو ضرب لگائی ہے میرے مولا ع کو تونے
            {'\n'}اس وار پے لعنت تیری تلوار پے لعنت
            {'\n'}لعنت بیشمار{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default QatlGhazika 
