import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const Shehzadiyan = () => {
  return (
    <View>
        <Text style={styles.text}>
            جس گھڑی زندان کا دَر کھولا گیا
            بی بیوں کو دیکھ کر سجادؑ نے روکر کہا

            {'\n\n'}اللہ اللہ آ رہا ہے سیدوں کا قافلہ

            {'\n\n'}کربلا والوں كے غم میں بیچھ گیا فرشِ اذا
            سامنے جب آئے شہزادوں كے سَر
            شہزادیاں روتی رھیں

            {'\n\n'}ہائے علی اصغر
            {'\n'}ڈھونڈ کر اصغر کا سَر کہنے لگیں اُمِ رباب
            کاش میں بھی دیکھ پاتی اپنے بیٹے کا شباب
            بری بری چُومتے اصغر کا سَر
            شہزادیاں روتی رھیں

            {'\n\n'}ہائے عون و محمد
            {'\n'}۲ سروں کو دیکھ کر فِضہ نے زینب سے کہا
            آ گئے عون و محمد لیجیے پُرْسَہ میرا
            کر دیا زینب نے سجدہ خاک پر
            شہزادیاں روتی رھیں

            {'\n\n'}ہائے آ قاسم
            {'\n'}آیا جب زندان میں ۱۳ برس والے کا سَر
            غُل ہوا اِبنِ حسن کو کھا گئی کس کی نظر
            بین فرواں نے کیے تو چیخ کر
            شہزادیاں روتی رھیں

            {'\n\n'}ہائے علی اکبر
            {'\n'}جب علی اکبر کا سَر آیا قیامت ہو گئی
            یوں لگا كے اُمِ لیلیٰ کی شہادت ہو گئی
            دیکھ کر اکبر کا چہرہ خوں میں تر
            شہزادیاں روتی رھیں

            {'\n\n'}ہائے عباسؑ
            {'\n'}حضرتِ عباسؑ کا سَر آ گیا جب یہ سُنا
            بی بیوں میں ماتمِ عباس برپا ہو گیا
            بند آنکھیں با وفا کی دیکھ کر
            شہزادیاں روتی رھیں

            {'\n\n'}ہائے حسینؑ
            {'\n'}سَر حسینؑ اِبنِ علیؑ کا واردِ زنداں ہُوا
            زخم اولادِ علی کا اور تازہ ہو گیا
            چادریں اپنے سروں سے پھینک کر
            شہزادیاں روتی رھیں

            {'\n\n'}ہائے سكینہ
            {'\n'}گود میں بابا کا سَر تھا اور سكینہ کو قضا
            لے گئی زندان سے سجاد نے جب یہ کہا
            بس یہی تک تھا سكینہ کا سفر
            شہزادیاں روتی رھیں

            {'\n\n'}اَخْتَر و عرفان کوئی کیا بیاں کر پائیگا
            قید کھانے كے مصائب سُن كے دِل پھٹ جائیگا
            تکتے تکتے رات دن زنداں کا دَر
            شہزادیاں روتی رھیں{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default Shehzadiyan 
