import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const AlamAbbaska = () => {
  return (
    <View>
        <Text style={styles.text}>
            ائے لوگوں آؤ تم کو بتاؤں
            رحمتِ باری تم کو دیکھاؤں
            سارے جہاں کا ہے اک سہارا
            یہ جو علم میرے گھر پہ لگا ہے
            یہ ہےعلم عباس کا

            {'\n\n'}غم سے نکالے ، مشکلیں ٹالے
            کیسا وصیلہ رب نے دیا
            یہ ہےعلم عباس کا

            {'\n\n'}ہم نے علم جب گھر میں سجایا
            گھر میں رکھے زہرہ نے قدم
            دور ہوئے سب رنج و ماسائب
            پِھر کیسی مشکل کیسا غم
            دستے کرم ہے ، شہہ کا بھرم ہے
            جسکا کوئی ثانی نا ملا
            یہ ہےعلم عباس کا

            {'\n\n'}یہ جو بندھی ہے مشک سكینہ
            اسکو کہو تعویزِ وفا
            رشتہ بھتیجی اور چچا کا
            آج تلک نا ٹوٹ سکا
            اک کہانی ، اسکی زبانی
            سُن لو اگر سُن تے ہو سدا
            یہ ہےعلم عباس کا

            {'\n\n'}دیکھوعلم کا سرخ پھریرا
            چادر زینب سے ہے بنا
            جو بھی علم كے سائے میں آیا
            دُنیا كے سب غم بھول گیا
            اب جاکے منع ، سارا زمانہ
            سایہ فیغن گھر گھر پہ ہوا
            یہ ہےعلم عباس کا

            {'\n\n'}ایساعلم دُنیا میں دکھاؤ
            جسکی عطا ہو رب کی عطا
            شانِ آزاداری یہ علم ہے
            دیکھوعزاخانو میں ذرا
            ماناتیں پوری ، کرتا ہے سب کی
            زندہ ہے اس کے دم سے وفا
            یہ ہےعلم عباس کا

            {'\n\n'}حمزہ و جعفر کا یہ علم ہے
            ہے یہ علم حیدر کا علم
            دیں گے گواہی شاہ زمان بھی
            ہے یہ میرے لشکر کاعلم
            باروا حیدر ، کعبے کی چھت پر
            لہرا كے اسکو دیگا سدا
            یہ ہےعلم عباس کا

            {'\n\n'}قتل ہوا جب دریا پہ غازی
            ٹوٹ گئی مولا کی کمر
            لاشہ نہیں شہہ لائے جاری کا
            لائے علم ہی خون میں تر
            بیٹی سے بولے ، شبیر روکے
            آئے نہیں دریا سے چچا
            یہ ہےعلم عباس کا

            {'\n\n'}کربوبالا كے دشت کا منظر
            کیسے لکھوں روتا ہے قلم
            بعد جاری اولاد پیمبر
            نوحاکونا تھی زیر علم
            بالی سكینہ ، کرتی تھی نوحہ
            سائے میں اس کے آئے قضا
            یہ ہےعلم عباس کا

            {'\n\n'}پنجہ علم کا میسم و مظہر
            دستے کرم عباس کا ہے
            پال رہا ہے سارے جہاں کو
            یہ بھی ہشم عباس کا ہے
            جس نے جو مانگا ، اس نے وہ پایا
            پِھر تو زمانے کو کہنا پڑا
            یہ ہےعلم عباس کا{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default AlamAbbaska;
