import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const MatamKaro = () => {
  return (
    <View>
        <Text style={styles.text}>
            ماتم کرو حسین علیہ السلام کا

            {'\n\n'}اک دن میں گھر اجڑ گیا لوگوں امام کا
            ماتم کرو حسین علیہ السلام کا

            {'\n\n'}سوکھا ہوا تھا سید مظلوم کا گلا
            پانی نہیں ملا ، پانی نہیں ملا
            گردن پہ شہہ كے شمر نے خنجر چلا دیا
            روتی تھی سعیدہ ، روتی تھی سعیدہ
            کیا حال کر دیا گیا آلی مقام کا
            ماتم کرو حسین علیہ السلام کا

            {'\n\n'}اک دن میں دِل پہ زخم 72 كے کھائے ہے
            خون میں نہائے ہیں ، خون میں نہائے ہیں
            ہُر جون اور حبیب كے لاشے اٹھائے ہیں
            آنسو بہائے ہیں ، آنسو بہائے ہیں
            خیموں تلک جنازہ جو لایا غلام کا
            ماتم کرو حسین علیہ السلام کا

            {'\n\n'}سینے سے اپنے بیٹے كے نیزا جدا کیا
            ہائے وا مسیباتا ، ہائے وا مسیباتا
            زہرہ کا لال دشت میں بے نور ہو گیا
            ہائے وا مسیباتا ، ہائے وا مسیباتا
            اس بے وطن کا ہائے شاہ تشناکام کا
            ماتم کرو حسین علیہ السلام کا

            {'\n\n'}زینب كے دِل پہ کیسی قیامت گزر گئی
            دُنیا اجڑ گئی ، دُنیا اجڑ گئی
            مقتل میں شہہ کی لاش کی بے حرمتی ہوئی
            وہ دیکھتی رہی ، وہ دیکھتی رہی
            پامال لاشہ ہو گیا شاہ انام کا
            ماتم کرو حسین علیہ السلام کا

            {'\n\n'}مولا كے خاندان پہ بڑھتی گئی جفا
            چھینی گئی ردا ، چھینی گئی ردا
            چلتا تھا گرم ریت پہ کانٹوں پہ قافلہ
            بازار آ گیا ، بازار آ گیا
            نیزی پہ دیکھتا رہا منظر جو شام کا
            ماتم کرو حسین علیہ السلام کا

            {'\n\n'}پیاسوں کو یاد کر كے سابیلایں لگاؤ تم
            پانی پلاؤ تم ، پانی پلاؤ تم
            کالا لباس پہنوں علم بھی سجاؤ تم
            یوں غم مناؤں تم ، یوں غم مناؤں تم
            فرش اذا بچھاؤں شہیدوں كے نام کا
            ماتم کرو حسین علیہ السلام کا

            {'\n\n'}اک پل نا بھول پائیگی غربت حسین کی
            جب تک ہے زندگی ، جب تک ہے زندگی
            یوں ہی کرینگے میسم و ازلان اعظمی
            مولا کی نوکری ، مولا کی نوکری
            زہرہ سے اجر ہم کو ملے گا كلام کا
            ماتم کرو حسین علیہ السلام کا{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default MatamKaro;
