import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const SakinaShamke = () => {
  return (
    <View>
        <Text style={styles.text}>
            سكینہؑ شَام كے زنداں میں سو گئی بابا

            {'\n\n'}تماچے شمر سے کھاتی تھی جب بھی روتی تھی
            اندھیری رات میں اُٹھ اُٹھ كے بس یہ کہتی تھی
            میری اسیری پہ روتی ہے بے کسی بابا
            سكینہؑ شَام كے زنداں میں سو گئی بابا

            {'\n\n'}ہائے بابا آپ کے سینے کی اُسکو عادت تھی
            زمیں پہ سونے کی کوشش میں جاگتی ہی رہی
            تیری یتیما کو نیند آئی نا کبھی بابا
            سكینہؑ شَام كے زنداں میں سو گئی بابا

            {'\n\n'}پھوپھی سے کہتی تھی رو رو كے یہ بتا دو پھوپھی
            ستم کی قید سے گھر اپنے جا سکے گے کبھی
            اُسے رہائی نا مر كے بھی مل سکی بابا
            سكینہؑ شَام كے زنداں میں سو گئی بابا

            {'\n\n'}بنائی آپ نے مقتل میں قبر اصغر کی
            لحد بنائی ہے زندان میں میں نے مُزتر کی
            کہیں جو فاتحہ روتی تھی ہتھکڑی بابا
            سكینہؑ شَام كے زنداں میں سو گئی بابا

            {'\n\n'}کفن لہو بھرا کُرتا ہی ہے سكینہ کا
            کیا ہے غوسل بھی اشکوں سے اے میرے بابا
            کفن بھی روتا تھا اور میں بھی قبر بھی بابا
            سكینہؑ شَام كے زنداں میں سو گئی بابا

            {'\n\n'}نہیں ذرا سا اُجالا بھی اُسکی تُربت پر
            اندھیرے کرنے لگے نوحہ اُسکی تربت پر
            کرے گا کون یہاں آکے روشنی بابا
            سكینہؑ شَام كے زنداں میں سو گئی بابا

            {'\n\n'}بیان کیسے کریں گے یہ میسم و مظہر
            جو بین بابا سے کرتے تھے عابِدِ مُزتر
            سكینہ شام كے زندان میں سو گئی بابا
            سكینہؑ شَام كے زنداں میں سو گئی بابا{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default SakinaShamke;
