import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const SaqqaeSakina = () => {
  return (
    <View>
        <Text style={styles.text}>
            سقائے سکینہ عباس عباس

            {'\n\n'}دو مجھکو سہارا عباس عباس
            سقائے سکینہ عباس عباس

            {'\n\n'}ٹھری ہوئی نظریں مری تیرے علم پر
            شک مجھکو نہیں کوئی ترے لطف و کرم پر
            تو بابِ حائج ہے نظر رکھتا ہے ہم پر
            مشکل سے بچانا عباس عباس
            سقائے سکینہ عباس عباس

            {'\n\n'}بن ہاتھوں کے تم جھولیاں بھر دیتے ہو مولا ع
            احسان کرو مجھ پے میں بندہ ہوں تمہارا
            مفلس ہوں بہت کربوبلا آ نہیں سکتا
            کیا تم سے چھپانا عباس عباس
            سقائے سکینہ عباس عباس

            {'\n\n'}سب رنج و الم میں نے زمانے سے چھپائے
            آیا ہوں ترے سامنے ہاتھوں کو اُٹھائے
            منہ موڑ گئے مجھ سے سبھی اپنے پرائے
            دل زخمی ہے میرا عباس عباس
            سقائے سکینہ عباس عباس

            {'\n\n'}دنیا کی مصیبت نے مجھے گھیر لیا ہے
            آقا تیرا خادم یہ پریشان ہوا ہے
            تم مجھکو بچا لو گے مجھے یہ بھی پتا ہے
            بس دیر نا کرنا عباس عباس
            سقائے سکینہ عباس عباس

            {'\n\n'}عباس ع حبیب ابنِ مظاہر سے یہ کہنا
            ذواروں کی فہرست میں اب نام ہو میرا
            سامانِ سفر بھی میرا تیار ہے مولا ع
            تم مجھکو بلانا عباس عباس
            سقائے سکینہ عباس عباس

            {'\n\n'}زہراؑ کی قسم ہے میری الجھن کو مٹا دو
            اک پھول علم سے میرے دامن میں گرا دو
            ہمت مجھے مل جائے اشارے سے بتا دو
            تم ساتھ ہو مولاؑ عباس عباس
            سقائے سکینہ عباس عباس

            {'\n\n'}تو بھائی ہے شبیر ع کا حیدر ع کا ہے بیٹا
            دنیا میں نہیں اتنا سخی کوئی گھرانہ
            تیری ہی سخاوت کا زمانے میں ہے چرچہ
            تو در ہے عطا کا عباس عباس
            سقائے سکینہ عباس عباس

            {'\n\n'}سر پر نہیں جن لوگوں کے ماں باپ کا سایہ
            ان سب کے نگہبان تم ہی ہو میرے مولا ع
            مادر کا ہی آنچل ہے یہ پرچم کا پھریرا
            کرتے رہو سایہ عباس عباس
            سقائے سکینہ عباس عباس

            {'\n\n'}دیتے ہیں سکینہ ع کی قسم اس لئیے مولا ع
            ہے میثم و ازلانؔ کا مولا ع یہ عقیدہ
            تم رد نہیں کر سکتے کبھی بھی یہ وسیلہ
            ہے پورا بھروسہ عباس عباس
            سقائے سکینہ عباس عباس{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default SaqqaeSakina;
