import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const Taboot = () => {
  return (
    <View>
        <Text style={styles.text}>
            شہیدوں كے ہیں یہ جنازے
            غریبوں كے ہیں یہ جنازے
            عزاداروں آؤ مل کر اُٹھاؤ
            ٧٢ كے تابوت ہیں

            {'\n\n'}پڑھو ساتھ نوحہ تم آنسو بہاو
            ٧٢ كے تابوت ہیں
            عزاداروں آؤ مل کر اُٹھاؤ
            ٧٢كے تابوت ہیں

            {'\n\n'}٧٢ کا اک دن میں فرزندِ زہرہ
            جنازے اُٹھا کر اکیلے ہی لایا
            بڑی بےبسی سے ہر اک سمت دیکھا
            نہیں تھا کوئی بھی مدد کرنے والا
            تم عاشور کا دن تصور میں لاؤ
            ٧٢ كے تابوت ہیں
            عزاداروں آؤ مل کر اُٹھاؤ
            ٧٢ كے تابوت ہیں

            {'\n\n'}ہُوا جن کا مقتل میں پامال لاشا
            کہیں پر بدن تھے کہیں انکا سَر تھا
            وہ جن کو کفن بھی میسر نا آیا
            نہیں تھا جنازوں پہ ان سب كے سایہ
            رکھو پھول ان پر کفن تم اورہاوں
            ٧٢ كے تابوت ہیں
            عزاداروں آؤ مل کر اُٹھاؤ
            ٧٢ كے تابوت ہیں

            {'\n\n'}ہرایر و زوہیر اور ہُر ، وہبِ قلبی
            ہیں جاؤن اور آبیس كے جیسے سپاھی
            سعید اور شوزاب ، حبیبِ حسینی
            وہ اصغر ہوں قاسم ہوں اکبر یا غازی
            ہم ان کے ہیں وارث جہاں کو بتاؤ
            ٧٢ كے تابوت ہیں
            عزاداروں آؤ مل کر اُٹھاؤ
            ٧٢ كے تابوت ہیں

            {'\n\n'}ہیں ان میں سبھی سعیدہ كے دولارے
            جنہیں باوفا بھائی کہہ کر پکارے
            سبھی تھے حسین ابنِ حَیدَر كے پیارے
            علم كے ہی سائے میں رہتے تھے سارے
            تم ان پر علم کا پھاریرا بِچھاؤں
            ٧٢ كے تابوت ہیں
            عزاداروں آؤ مل کر اُٹھاؤ
            ٧٢ كے تابوت ہیں

            {'\n\n'}اک ایسا ہو تابوت جس پر ہوں ز ہرا
            اٹھے ایک تابوت گاٹھری كے جیسا
            ہو تابوت كے ساتھ ننہا سا جھولا
            مگر ہے جو تابوت ربِ وفا کا
            سكینہ کا مشکیزہ اس پر سجااو
            ٧٢ كے تابوت ہیں
            عزاداروں آؤ مل کر اُٹھاؤ
            ٧٢ كے تابوت ہیں

            {'\n\n'}اب اِس سلسلے کو ہے آگے بڑہ انا
            جب آؤ تو بچوں کو ہمراہ لانا
            انہیں یہ ادب اور سلیقہ سِکھانا
            وراثت یہ نسلوں کو تم سونپ جانا
            جو زہرہ سے وعدہ کیا وہ نبھاؤ
            ٧٢ كے تابوت ہیں
            عزاداروں آؤ مل کر اُٹھاؤ
            ٧٢ كے تابوت ہیں

            {'\n\n'}یہ ازلان و میسم جہاں کو بتانا
            شاہِ دین کو ان سب نے تنہا نا چھوڑا
            ہم ان کو بھی ہونے نہیں دینگے تنہا
            دعائیں ہمیں دینگی خود بی بی زہرہ
            دلوں کی مرادیں یہاں آکے پاؤں
            ٧٢ كے تابوت ہیں
            عزاداروں آؤ مل کر اُٹھاؤ
            ٧٢ كے تابوت ہیں{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default Taboot;
