import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const TaweezeHassan= () => {
  return (
    <View>
        <Text style={styles.text}>
            ہائے حسن ہائے حسین
            تعویزِ حسن جب قاسم نے شبیر کو دکھلایا
            بھائی کو بھائی یاد آیا

            {'\n\n'}خط بھائی کا پڑھ کر روئے دِل درد سے تھارایا
            بھائی کو بھائی یاد آیا
            تعویزِ حسن جب قاسم نے شبیر کو دکھلایا
            بھائی کو بھائی یاد آیا

            {'\n\n'}اک پل كے لیے نظروں میں پھرا
            بھائی کی شہادت کا منظر
            کیا بین کیے تھے بہنوں نے
            تھا طشت میں تکڑے تکڑے جگر
            قاسم کا کہی یہ حال نا ہو
            اِس بات نے تڑپایا ، بھائی کو بھائی یاد آیا
            تعویزِ حسن جب قاسم نے شبیر کو دکھلایا
            بھائی کو بھائی یاد آیا

            {'\n\n'}تحریر میں شابر نے یہ کہا
            تسکینِ محبت دے دینا
            مقتل کی اِجازَت جب مانگے
            قاسم کو اِجازَت دے دینا
            تب نوحہ کیا اور قاسم کو
            سینے سے لیپٹایا ، بھائی کو بھائی یاد آیا
            تعویزِ حسن جب قاسم نے شبیر کو دکھلایا
            بھائی کو بھائی یاد آیا

            {'\n\n'}خط پڑھ كے اِجازَت دی شہہ نے
            ہتھیار سجائے قاسم نے
            تلوار لگا کر پٹکے میں
            جوہر وہ دکھائے قاسم نے
            صدقہ جو اُتارا زینب نے
            دِل شاہ کا بھر آیا ، بھائی کو بھائی یاد آیا
            تعویزِ حسن جب قاسم نے شبیر کو دکھلایا
            بھائی کو بھائی یاد آیا

            {'\n\n'}گھوڑے سے گرا جب ابنِ حسن
            مولا کو پکارا وا ویلا
            پہنچے جو شاہِ دین مقتل میں
            پامال بدن تھا قاسم کا
            بھائی كے پِسر کو مولا نے
            اِس حال میں جب پایا ، بھائی کو بھائی یاد آیا
            تعویزِ حسن جب قاسم نے شبیر کو دکھلایا
            بھائی کو بھائی یاد آیا

            {'\n\n'}پِھر اپنی عبع كے دامن میں
            قاسم کو سمیٹا مولا نے
            کس طرح اُٹھاؤں یہ لاشا
            غازی کو پکارا مولا نے
            قاسم کا سراپا ٹکڑوں میں
            تقدیر نے دکھلایا ، بھائی کو بھائی یاد آیا
            تعویزِ حسن جب قاسم نے شبیر کو دکھلایا
            بھائی کو بھائی یاد آیا

            {'\n\n'}خیمے میں جو نہی لائے لاشا
            سَر اہلِ حرام نے پیٹ لیا
            فیزا نے کلیجہ تھام لیا
            زینب كے لبوں پر نوحہ تھا
            فرواں کی طرف دیکھا شہہ نے
            آنکھوں میں لہو آیا ، بھائی کو بھائی یاد آیا
            تعویزِ حسن جب قاسم نے شبیر کو دکھلایا
            بھائی کو بھائی یاد آیا

            {'\n\n'}میسم وہ قیامت کا منظر
            تحریر میں لایا ہے مظہر
            گٹھری کو جو نہی کھولا شہہ نے
            سعدات ہوئے پِھر خاک بسر
            اشکوں کو علی کا بیٹا بھی
            تب روک نہیں پایا ، بھائی کو بھائی یاد آیا
            تعویزِ حسن جب قاسم نے شبیر کو دکھلایا
            بھائی کو بھائی یاد آیا{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default TaweezeHassan
