import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const AbbaskiSawari = () => {
  return (
    <View>
        <Text style={styles.text}>
            واویلا ہائے واویلا
            نا جا اکبر نا جا
            خایموں سے صدائیں آتی ہیں
            اکبر کی سواری جاتی ہے

            {'\n\n'}خایموں میں بتا ہے واویلا
            اکبر کی سواری جاتی ہے
            نا جا اکبر نا جا
            خایموں سے صدائیں آتی ہیں
            اکبر کی سواری جاتی ہے

            {'\n\n'}ہَم شاکلِ پیمبرﷺ جاتا ہے
            دِل باپ کو ڈُبا جاتا ہے
            سَر پیٹ رہی ہیں ماں دُکھیا
            اکبر کی سواری جاتی ہے
            خایموں سے صدائیں آتی ہیں
            اکبر کی سواری جاتی ہے

            {'\n\n'}اتھاراں برس نظموں سے جسے
            پروان چڑھایا زینبؑ نے
            گُلشن ہے اُجڑا زینب کا
            اکبر کی سواری جاتی ہے
            خایموں میں بتا ہے واویلا
            اکبر کی سواری جاتی ہے
            نا جا اکبر نا جا
            خایموں سے صدائیں آتی ہیں
            اکبر کی سواری جاتی ہے

            {'\n\n'}کہتی تھی سكینہ رُو رُو کر
            لُٹاو بھائی علی اکبر
            قدموں سے لپٹی معصومہ
            اکبر کی سواری جاتی ہے
            خایموں سے صدائیں آتی ہیں
            اکبر کی سواری جاتی ہے

            {'\n\n'}اکبر سے سكینہ جب لپٹی
            شبیر کو صُغرا یاد آئی
            اُوسے کیسے باتیں یہ بابا
            اکبر کی سواری جاتی ہے
            خایموں میں بتا ہے واویلا
            اکبر کی سواری جاتی ہے
            نا جا اکبر نا جا
            خایموں سے صدائیں آتی ہیں
            اکبر کی سواری جاتی ہے

            {'\n\n'}کچھ دیر رُکو بیٹا اکبر
            میں تم کو بنا تو لوں دھلہا
            افسوس نا راس آیا صحرا
            اکبر کی سواری جاتی ہے
            خایموں سے صدائیں آتی ہیں
            اکبر کی سواری جاتی ہے

            {'\n\n'}تیری یاد بُہت تڑپائے گی
            ماں جیتے جی مر جائے گی
            مادر كے لبوں پر ہے نوحہ
            اکبر کی سواری جاتی ہے
            خایموں میں بتا ہے واویلا
            اکبر کی سواری جاتی ہے
            نا جا اکبر نا جا
            خایموں سے صدائیں آتی ہیں
            اکبر کی سواری جاتی ہے

            {'\n\n'}جاؤ اکبر
            {'\n'}شہہ کہتے تھے جاؤ اکبر
            مجھے دیکھتے رہنا مڑ مڑ کر
            دیتا ہے سدا بُڑھا بابا
            اکبر کی سواری جاتی ہے
            خایموں میں بتا ہے واویلا
            اکبر کی سواری جاتی ہے
            نا جا اکبر نا جا
            خایموں سے صدائیں آتی ہیں
            اکبر کی سواری جاتی ہے

            {'\n\n'}واویلا ہائے واویلا{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default AbbaskiSawari;
