import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const Janesakina = () => {
  return (
    <View>
      <Text style={styles.text}>
            بابا کوجای بابا کوجای
            کہاں ہو بابا

            {'\n\n'}چراغِ زندہ خاموشِ ام شب
            ائ بابا یہ خوبام کوجای کوجای

            {'\n\n'}بابا تم پاس نہیں ، چچا عباس نہیں
            بابا تم پاس نہیں ، کوئی بھی آس نہیں آس نہیں
            چراغِ زندہ خاموشِ ام شب
            ائ بابا یہ خوبام کوجای کوجای

            {'\n\n'}بابا میں قید میں ہوں آپ کہاں ہو بابا
            لاڈلی بیٹی کو اک بار پُکارو بابا
            پاس آؤ یا مجھے پاس بُلا لو بابا
            اپنے دامن میں سكینہ کو چُھپا لو بابا
            میرے بابا مجھے دو آ كے سہارا
            ائ جانِ سكینہ کہاں ہو کہاں ہو
            چراغِ زندہ خاموشِ ام شب
            ائ بابا یہ خوبام کوجای کوجای
            بابا تم پاس نہیں ، چچا عباس نہیں
            بابا تم پاس نہیں ، کوئی بھی آس نہیں آس نہیں
            چراغِ زندہ خاموشِ ام شب
            ائ بابا یہ خوبام کوجای کوجای

            {'\n\n'}ہائے سہتی ہے سِتم آپ کی بیٹی بابا
            خون بہتا ہے میرے کان ہیں زخمی بابا
            چھین کر لے گئے کیوں بالیاں میری بابا
            مانگتے آ كے جو مجھ سے تو میں دیتی بابا
            کتنا مشکل ہے سكینہ کا گُزارا
            ائ جانِ سكینہ کہاں ہو کہاں ہو
            چراغِ زندہ خاموشِ ام شب
            ائ بابا یہ خوبام کوجای کوجای
            بابا تم پاس نہیں ، چچا عباس نہیں
            بابا تم پاس نہیں ، کوئی بھی آس نہیں آس نہیں
            چراغِ زندہ خاموشِ ام شب
            ائ بابا یہ خوبام کوجای کوجای

            {'\n\n'}بابا کل خواب میں تم پس میرے آئے تھے
            گود میں اصغرِ معصوم کو بھی لائے تھے
            بھائی اکبر چچا عباس یہیں بیٹھے تھے
            باری باری گلے لپٹا كے مجھے روتے تھے
            جانے کب دیکھوں گی کنبہ میں دوبارہ
            ائ جانِ سكینہ کہاں ہو کہاں ہو
            چراغِ زندہ خاموشِ ام شب
            ائ بابا یہ خوبام کوجای کوجای
            بابا تم پاس نہیں ، چچا عباس نہیں
            بابا تم پاس نہیں ، کوئی بھی آس نہیں آس نہیں
            چراغِ زندہ خاموشِ ام شب
            ائ بابا یہ خوبام کوجای کوجای

            {'\n\n'}ایک دن بابا کا سَر بالی سكینہ کو ملا
            اشک بار آنکھوں سے بابا نے سكینہ سے کہا
            ہائے کس حال میں تم ہم سے ملی ہو بیٹا
            اب وہ سینہ ہی نہیں جس پہ سولائے بابا
            اپنا سَر رکھ دے میرے سَر پہ سكینہ بابا
            بابا سكینہ بابا سكینہ بابا سكینہ
            چراغِ زندہ خاموشِ ام شب{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default Janesakina;
