import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const Yaghazi = () => {
  return (
    <View>
      <Text style={styles.text}>
            یا غازی یا مولا سب کا سہارا مولا
            عباس عباس

            {'\n\n'}سادات کا پیارا یا غازی
            مولا ہے ہمارا یا غازی
            سب نے ہے پُکارا یا غازی

            {'\n\n'}ہر دِل کا سہارا یا غازی
            ہر لب پہ ہے نعرہ یا غازی
            عباس یا عباس یا عباس یا ابالفضل

            {'\n\n'}جب پاک علم لہراتا ہے
            مجھے یاد تو غازی آتا ہے
            میرے دِل کا وازیفہ یا غازی
            ہر میرا عقیدا یا غازی
            سادات کا پیارا یا غازی
            مولا ہے ہمارا یا غازی
            سب نے ہے پُکارا یا غازی
            ہر دِل کا سہارا یا غازی
            ہر لب پہ ہے نعرہ یا غازی
            عباس یا عباس یا عباس یا ابالفضل

            {'\n\n'}سلطانِ وفا غازی مولا
            جاگیر تمہاری کربوبلا
            روزہِ پہ بُلانا یا غازی
            جاگیر دِکھانا یا غازی
            ہر دِل کا سہارا یا غازی
            ہر لب پہ ہے نعرہ یا غازی
            یا غازی یا مولا سب کا سہارا مولا
            عباس عباس یا ابالفضل

            {'\n\n'}سادات كے دِل کی آس ہو تم
            زہرہ کی دعا عباس ہو تم
            زینب نے ہے پالا یا غازی
            شبیر کا سایہ یا غازی
            سادات کا پیارا یا غازی
            مولا ہے ہمارا یا غازی
            سب نے ہے پُکارا یا غازی
            ہر دِل کا سہارا یا غازی
            ہر لب پہ ہے نعرہ یا غازی
            عباس یا عباس یا عباس یا ابالفضل

            {'\n\n'}عباس تیری عظمت کی قسم
            اُنچا ہی سدا دیکھا ہے علم
            تیری شان ہے اعلی یا غازی
            تیرا بھو ہے بھلا یا غازی
            ہر دِل کا سہارا یا غازی
            ہر لب پہ ہے نعرہ یا غازی
            یا غازی یا مولا سب کا سہارا مولا
            عباس عباس یا ابالفضل

            {'\n\n'}جب مشک و علم کی بات چلی
            معصوم سكینہ یاد آئی
            بچی کا وہ رونا یا غازی
            رو رو كے بلا نا یا غازی
            سادات کا پیارا یا غازی
            مولا ہے ہمارا یا غازی
            سب نے ہے پُکارا یا غازی
            ہر دِل کا سہارا یا غازی
            ہر لب پہ ہے نعرہ یا غازی
            عباس یا عباس یا عباس یا ابالفضل

            {'\n\n'}تیرے بعد حسین ہوئے تنہا
            لاکھوں نے غریب کو گھیر لیا
            سید کا تھا نوحہ یا غازی
            بھائی ہے بیچھاڑتا یا غازی
            ہر دِل کا سہارا یا غازی
            ہر لب پہ ہے نعرہ یا غازی
            یا غازی یا مولا سب کا سہارا مولا
            عباس عباس یا ابالفضل{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default Yaghazi;
