import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const AeyNeher = () => {
  return (
    <View>
      <Text style={styles.text}>
            اے نہرِعَلقمَہ

            {'\n\n'}آج بھی اِس بے کَسی پر رو رہی ہے کربلا
            عَلقمَہ بہاتی رہی اور قافلہ پیاسا رہا
            اے نہرِعَلقمَہ

            {'\n\n'}پیاسا تھا تیرے سامنے کُنبہ رسولﷺ کا
            اے نہرِعَلقمَہ

            {'\n\n'}اے نہرِعَلقمَہ تیرا مہمان تھا حُسین
            یوں تیرے پاس رہ كے بھی اُسکو ملا نا چین
            تُجھ سے ہے یہ گِلہ اے نہرِعَلقمَہ
            پیاسا تھا تیرے سامنے کُنبہ رسولﷺ کا
            اے نہرِعَلقمَہ

            {'\n\n'}خیمے تھے اہلِ بیت كے کتنے تیرے قریب
            پیاسے ہی تیرے سامنے وہ مر گئے غریب
            روتی تھی کربلا اے نہرِعَلقمَہ
            آج بھی اِس بے کَسی پر رو رہی ہے کربلا
            عَلقمَہ بہاتی رہی اور قافلہ پیاسا رہا
            اے نہرِعَلقمَہ

            {'\n\n'}مشکیزہ جِسکے ہاتھ میں تھا دوش پر علم
            ساحِل پہ تیرے آئے تھے عباس كے قدم
            رُتبہ تجھے مِلا اے نہرِعَلقمَہ
            پیاسا تھا تیرے سامنے کُنبہ رسولﷺ کا
            اے نہرِعَلقمَہ

            {'\n\n'}سوکھی پڑی تھی مشکِ سكینہ ترائی میں
            دو بوند پانی کیا نا تھا ساری خدائی میں
            ہائے توں نے یہ کیا کیا اے نہرِعَلقمَہ
            آج بھی اِس بے کَسی پر رو رہی ہے کربلا
            عَلقمَہ بہاتی رہی اور قافلہ پیاسا رہا
            اے نہرِعَلقمَہ

            {'\n\n'}اک بے کسی سی اہلِ حرم پر تمام تھی
            کتنی اُداس شامِ غریباں کی شام تھی
            اے وامُسیباتا اے نہرِعَلقمَہ
            پیاسا تھا تیرے سامنے کُنبہ رسولﷺ کا
            اے نہرِعَلقمَہ

            {'\n\n'}نوحوں میں ہیں جو تذکِراِ عَلقمَہ حلال
            چاروں طرف ہے آج بھی اک ماتمِ ملال
            جاری ہے یہ اذا اے نہرِعَلقمَہ
            آج بھی اِس بے کَسی پر رو رہی ہے کربلا
            عَلقمَہ بہاتی رہی اور قافلہ پیاسا رہا{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default AeyNeher;
