import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const Alambardar = () => {
  return (
    <View>
      <Text style={styles.text}>
            یہ کون ہے فلک سارا لرزتا ہے
            یہ کون ہے زمین کا دِل دھڑکتا ہے
            علم بردار آتا ہے

            {'\n\n'}یہ لگتا ہے كے جیسے حیدرِ قرار آتا ہے
            علم بردار آتا ہے

            {'\n\n'}علم تھامے حسینی فوج کا سالار آتا ہے
            علم بردار آتا ہے
            یہ لگتا ہے كے جیسے حیدرِ قرار آتا ہے
            علم بردار آتا ہے

            {'\n\n'}فلک سارا لرزتا ہے زمین کا دِل دھڑکتا ہے
            فِزاں میں شور برپا ہے اَدوں کا دم نکلتا ہے
            جری یہ کون آتا ہے علم کس کا اُبھرتا ہے
            یزیدی فوج میں حَل چل دِلوں پہ خوف چھایا ہے
            یہ لگتا ہے كے جیسے حیدرِ قرار آتا ہے
            علم بردار آتا ہے

            {'\n\n'}جو تھی قرار کی ہیبت وہی عباس کی ہیبت
            خدا كے شیر جیسی ہے علی كے شیر کی طاقت
            وہی چہرہ وہی سیرت وہی جذبہ وہی جرات
            ابھی آیا نہیں لیکن ادوں پہ چھاں گئی دہشت
            مثالِ لافتہ شبیر کا سالار آتا ہے
            علم بردار آتا ہے
            علم تھامے حسینی فوج کا سالار آتا ہے
            علم بردار آتا ہے

            {'\n\n'}ابھی یہ شور بھرپا تھا كے گُنجا حیدری نعرہ
            مسالِ لافتہ غازی اچانک سامنے آیا
            مجھے عباس کہتے ہیں جری لالکار کر بولا
            علمدارِ حسینی ہوں غلامِ سیدِ والا
            سدا دیتا ہُوا یہ غازیِ جرار آتا ہے
            علم بردار آتا ہے
            یہ لگتا ہے كے جیسے حیدرِ قرار آتا ہے
            علم بردار آتا ہے

            {'\n\n'}یہاں تنہا دِلِ حیدر وہاں لاکھوں جفا پیکر
            یہاں بس خاتمِ نیزا وہاں تیغوں سینا خنجر
            یہاں سوکھا ہے مشکیزہ وہاں سیراب ہے لشکر
            یہاں شوقِ شہادت ہے وہاں شوقین مال و زَر
            مقابل مرحابوں كے صاحبِ کردار آتا ہے
            علم بردار آتا ہے
            علم تھامے حسینی فوج کا سالار آتا ہے
            علم بردار آتا ہے

            {'\n\n'}ادو سے چھین کر دریا علم عباس نے گاڑھا
            یزیدی فوج میں اُس دم اچانک شور یہ اٹھا
            ارے بھاگو ترائی سے علیؑ آیا علیؑ آیا
            پِھر اس كے بعد دریا پر فقط غازی نظر آیا
            جفا کراوں میں بن کر موت کی للکار آتا ہے
            علم بردار آتا ہے
            یہ لگتا ہے كے جیسے حیدرِ قرار آتا ہے
            علم بردار آتا ہے

            {'\n\n'}بھرا جس وقت مشکیزہ بڑا یاد آئی معصومہ
            لیے پانی سوئے خیمہ چلا سقا سكینہ کا
            بڑھا جب گھیرد غازی كے یزیدی فوج کا ہلکا
            کہا عباس نے دل میں سكینہ تم نا گھبرانا
            ابھی لیکر یہ مشکیزہ تیرا غم خوار آتا ہے
            علم بردار آتا ہے
            علم تھامے حسینی فوج کا سالار آتا ہے
            علم بردار آتا ہے

            {'\n\n'}علم غازی دلاور کا جب اُس كے خون میں ڈُبا
            بُریدا بازوئوں والا نا مشکیزہ بچہ پایا
            تڑپتا خاک پر دیکھا جو شہہ نے بھائی کا لاشا
            وفا کو ناز ہے تُجھ پر پکارے سیدِ والا
            خدایا پاس اب تیرے میرا سالار آتا ہے
            علم بردار آتا ہے
            یہ لگتا ہے كے جیسے حیدرِ قرار آتا ہے
            علم بردار آتا ہے

            {'\n\n'}یہ کون ہے علمدارِ حسین
            {'\n'}عباس{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default Alambardar;
