import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const ChaltaRahe = () => {
  return (
    <View>
      <Text style={styles.text}>
            حسین یا حسین یا حسین یا حسینا

            {'\n\n'}سینوں میں غم ہو سَر پہ علم ہو
            بڑھتا قدم ہو ماتم نا کم ہو
            چلتا رہے یہ کارواں بڑھتا رہے یہ کارواں

            {'\n\n'}حسین یا حسین یا حسین یا حسینا
            چلتا رہے یہ کارواں بڑھتا رہے یہ کارواں

            {'\n\n'}سینوں میں غم ہو سَر پہ علم ہو
            بڑھتا قدم ہو ماتم نا کم ہو
            چلتا رہے یہ کارواں بڑھتا رہے یہ کارواں

            {'\n\n'}یہ کارواں ہے اہلِ اذا کا
            یہ کارواں ہے کربوبلا کا
            سَر پہ علم ہے شاہِ وفا کا
            یہ سلسلہ ہے صبر و رِضا کا
            جب تک یہ دم ہو ، مولا کا غم ہو
            غم یہ نا کم ہو ، ہر آنکھ نم ہو
            مشک و علم ہو پاسباں
            چلتا رہے یہ کارواں
            حسین یا حسین یا حسین یا حسینا
            سینوں میں غم ہو سَر پہ علم ہو
            بڑھتا قدم ہو ماتم نا کم ہو
            چلتا رہے یہ کارواں بڑھتا رہے یہ کارواں

            {'\n\n'}اِس کارواں کا حسین رہبر
            شامل ہیں اِس میں شہہ كے بہتر
            جن و ملك بھی چلتے ہیں مل کر
            شامل ہیں ہم بھی ادنہ سے نوکر
            بزمِ اذا ہے راہِ وفا ہے
            سب کی سدا ہے سب کی دعا ہے
            روشن رہے یہ کہکشاں
            چلتا رہے یہ کارواں
            حسین یا حسین یا حسین یا حسینا
            سینوں میں غم ہو سَر پہ علم ہو
            بڑھتا قدم ہو ماتم نا کم ہو
            چلتا رہے یہ کارواں بڑھتا رہے یہ کارواں

            {'\n\n'}سلام تم پر حسین والوں
            اے عزادارو اے غم گُسارو
            علی و زہرہ كے جان نیسارو
            عشقِ نبی كے روشن ستارو
            اے پُرْسَہ درو اے سوگ وارو
            غازی كے پیارو شہہ كے دولارو
            تم پر خدا ہو مہربان
            چلتا رہے یہ کارواں
            حسین یا حسین یا حسین یا حسینا
            سینوں میں غم ہو سَر پہ علم ہو
            بڑھتا قدم ہو ماتم نا کم ہو
            چلتا رہے یہ کارواں بڑھتا رہے یہ کارواں

            {'\n\n'}حسین مولا کا قافلہ ہے
            مجلس و ماتم کا سلسلہ ہے
            نبی كے گھر کا یہ تذکرہ ہے
            حسینیت کا حامی خدا ہے
            یا رسول اللہ یا نبی اللہ
            ہم سب كے آقا دامن تمہارا
            حُسینیوں کا سائباں
            چلتا رہے یہ کارواں
            حسین یا حسین یا حسین یا حسینا
            سینوں میں غم ہو سَر پہ علم ہو
            بڑھتا قدم ہو ماتم نا کم ہو
            چلتا رہے یہ کارواں بڑھتا رہے یہ کارواں

            {'\n\n'}حسین کا غم زندہ رہے گا
            ماتم زمانہ کرتا رہے گا
            فرشِ اذا تو بچھتا رہے گا
            حسینی پرچم اُونچا رہے گا
            یہ آزاداری یہ پُرْسَہ داری
            گھر گھر ہے جاری گریہ و زاری
            نوحہ کُناں ہے دو جہاں
            چلتا رہے یہ کارواں
            حسین یا حسین یا حسین یا حسینا
            سینوں میں غم ہو سَر پہ علم ہو
            بڑھتا قدم ہو ماتم نا کم ہو
            چلتا رہے یہ کارواں بڑھتا رہے یہ کارواں

            {'\n\n'}کیا شان ہو گی اِس کارواں کی
            جب ہوں گے شامل امامِ مہدی
            شرفِ زیارت ہو گا ہمیں بھی
            ماتم بھی ہو گا مجلس بھی ہو گی
            ہم دیں گیں پُرْسَہ کربوبلا کا
            ہر بے ختا کا ہر بے رِدا کا
            مولا بھی ہوں گیں درمیاں
            چلتا رہے یہ کارواں
            حسین یا حسین یا حسین یا حسینا
            سینوں میں غم ہو سَر پہ علم ہو
            بڑھتا قدم ہو ماتم نا کم ہو
            چلتا رہے یہ کارواں بڑھتا رہے یہ کارواں
            حسین یا حسین یا حسین یا حسینا{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default ChaltaRahe;
