import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const Hazratimam = () => {
  return (
    <View>
      <Text style={styles.text}>
            دائیں حسن بائیں جاری پوشت پناہی کو نبی
            سَر پہ خدا وندِ جاری سینس پر زہرہ علی

            {'\n\n'}میرے مولا کو میسرہے خزانہ کیسا
            ان کا رتبہ ہے ایماموں میں شاہانہ کیسا
            کیسے کیسے ہیں نصیبوں میں اوجالے ان كے
            میرے آقاکو ملا ہے یہ گھرانا کیسا
            مرحبا مرحبا مصطفیٰ کی بات میں
            با خدا با خدا ساری کائنات میں
            گونج رہا ہے بس ایک نام
            حضرت امام حسین علیہ السلام

            {'\n\n'}لاکھوں درود آپ پہ لاکھوں السلام
            حضرت امام حسین علیہ السلام

            {'\n\n'}اللہ نے کیا خوب سوارا ہے
            سرکار كے آگن میں اتارا ہے
            ہر قوم کی آنکھوں کا ستارہ ہے
            حضرت امام حسین علیہ السلام

            {'\n\n'}زندہ ہے حسین اُس کا ہے کردار بھی زندہ
            کردار جو زندہ ہے تو میار بھی زندہ
            میار جو زندہ ہے تو افکار بھی زندہ
            افکار جو زندہ تو اعزا دار بھی زندہ
            ابتدا ابتدا مصطفیٰ كے دوش پر
            انتہا انتہا نیزے پر بلند سَر
            گونج رہا ہے بس ایک نام
            حضرت امام حسین علیہ السلام

            {'\n\n'}قدم قدم نگر نگر یا حسین
            دللام دللام نظر نظر یا حسین
            سدا کا تو کی راہ گُزر یا حسین
            کہو کہو با چشمہِ دَر یا حسین
            یا حسین یا حسین یا حسین

            {'\n\n'}تاریخ میں اِس جیسا نا انسان ملے گا
            ایسا نا کوئی آشکِ رحمان ملے گا
            نا ایسا کوئ شاہِ شہیدان ملے گا
            نا ایسا کوئ صبر کا سلطان ملے گا
            لا الہ لا الہ لا الہ کا پاسباں
            دیں پناہ دیں پناہ مصطفیٰ کا ترجمہ
            گونج رہا ہے بس ایک نام
            حضرت امام حسین علیہ السلام

            {'\n\n'}اللہ نے کیا خوب سوارا ہے
            سرکار كے آگن میں اتارا ہے
            ہر قوم کی آنکھوں کا ستارہ ہے
            حضرت امام حسین علیہ السلام

            {'\n\n'}ہر دِل میں غمِ سعیدِ اَبرار ملے گا
            ہر دور میں مظلوم کا غم خار ملے گا
            ہر قوم میں شبیر کا زوار ملے گا
            ہر ملک میں مولا کا عزا دار ملے گا
            ہر جگا ہر جگا مومنو كے درمیاں
            ہے سدا ہے سدا دھڑکنوں كے درمیاں
            گونج رہا ہے بس ایک نام
            حضرت امام حسین علیہ السلام

            {'\n\n'}قدم قدم نگر نگر یا حسین
            دللام دللام نظر نظر یا حسین
            سدا کا تو کی راہ گُزر یا حسین
            کہو کہو با چشمہِ دَر یا حسین
            یا حسین یا حسین یا حسین

            {'\n\n'}ہاتھوں میں علم تھامے وہ آتا ہے عزا دار
            ہاں مجلس و ماتم میں ہی رہتا ہے عزا دار
            ماں باپ حسینی ہوں تو بنتا ہے عزا دار
            مولا یہ تمہارا ہے تمہارا ہے عزا دار
            سلسلہ سلسلہ یہ اذا کا سلسلہ
            رابطہ رابطہ کربلا سے رابطہ
            گونج رہا ہے بس ایک نام
            حضرت امام حسین علیہ السلام

            {'\n\n'}اللہ نے کیا خوب سوارا ہے
            سرکار كے آگن میں اتارا ہے
            ہر قوم کی آنکھوں کا ستارہ ہے
            حضرت امام حسین علیہ السلام

            {'\n\n'}شبیر کا دِل دیکھے ذرا دیکھے زمانہ
            واللہ کہا تھا جو وہی کر كے دیکھایا
            خوش نودی خالق میں بھرے گھر کو لٹایا
            نیزی پہ بھی آیا تو اسی شان سے آیا
            بادشاہ بادشاہ ہے دلوں کا بادشاہ
            چھاہ گیا چھاہ گیا دو جہاں پہ چھاہ گیا
            گونج رہا ہے بس ایک نام
            حضرت امام حسین علیہ السلام

            {'\n\n'}قدم قدم نگر نگر یا حسین
            دللام دللام نظر نظر یا حسین
            سدا کا تو کی راہ گُزر یا حسین
            کہو کہو با چشمہِ دَر یا حسین
            یا حسین یا حسین یا حسین

            {'\n\n'}کس شان سے مقتل میں قدم رکھتا ہے شبیر
            کب جانے کی پرواہ کیا کرتا ہے شبیر
            ڈرتا ہے نا جُھکتا ہے نا گھبراتا ہے شبیر
            لاکھوں بھی مخالف ہوں تو سچ کہتا ہے شبیر
            ہونسلا ہونسلا شاہِ دین کا ہونسلا
            سُن سدا سُن سدا دو جہاں کی ہےسدا
            گونج رہا ہے بس ایک نام
            حضرت امام حسین علیہ السلام

            {'\n\n'}اللہ نے کیا خوب سوارا ہے
            سرکار كے آگن میں اتارا ہے
            ہر قوم کی آنکھوں کا ستارہ ہے
            حضرت امام حسین علیہ السلام

            {'\n\n'}ہاں آؤ کرے ہَم شہہ اَبرار کا ماتم
            اسلام كے محسن کا مدد گار کا ماتم
            اصغر علی اکبر کا اور انسار کا ماتم
            زینب کا سكینہ کا علم دَار کا ماتم
            بیختا بیخاتا ہے غریب سعیدہ
            ہے بَپا ہے بَپا تیرا غم جگہ جگہ
            گونج رہا ہے بس ایک نام
            حضرت امام حسین علیہ السلام

            {'\n\n'}دائیں حسن بائیں جاری پوشت پناہی کو نبی
            سَر پہ خدا وندِ جاری سینس پر زہرہ علی
            دائیں حسن بائیں جاری پوشت پناہی کو نبی
            سَر پہ خدا وندِ جاری سینس پر زہرہ علی

            {'\n\n'}حضرت امام حسین حسین
            ہائے شہِ مشراقین
            اے دلِ زہرہ كے چین
            ہاں میرے مولا حسین
            حضرت امام حسین حسین
            آلی مقام حسین حسین
            تم پہ سلام حسین حسین
            حضرت امام حسین حسین

            {'\n\n'}ہائے شہِ کربلا
            آپ کا گھر لٹ گئے
            وعدہ وفا کر دیا
            حضرت امام حسین حسین
            شاہِ زمان حسین حسین
            زخمی بدن حسین حسین
            تشنہ دھان حسین حسین
            حضرت امام حسین حسین{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default Hazratimam;
