import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const MazloomHussain = () => {
  return (
    <View>
      <Text style={styles.text}>
            یا حسین ، حسین یا حسین

            {'\n\n'}مظلوم حسین کی ہمشیرہ
            اسلام بچانے آئی ہے

            {'\n\n'}شبیر کا ساری دُنیا کو
            پیغام سُنانے آئی ہے
            مظلوم حسین کی ہمشییرا

            {'\n\n'}آشور كے دن جس بی بی کا
            آباد چمن برباد ہوا
            سب بھائی بھتیجھے مارے گئے
            سامان جلا گھر بار لُوٹا
            کچھ بھی نا بچہ لیکن زینب
            یہ دین بچانے آئی ہے
            مظلوم حسین کی ہمشیرہ
            اسلام بچانے آئی ہے
            شبیر کا ساری دُنیا کو
            پیغام سُنانے آئی ہے
            مظلوم حسین کی ہمشیرہ
            اسلام بچانے آئی ہے

            {'\n\n'}ہر خُطبہ اسکا مجلس ہے
            ہر آنسو اسکا ماتم ہے
            آشور بسا ہے آنكھوں میں
            اور دِل میں باہتر کا غم ہے
            یہ اہلِ اذا سے فرشِ اذا
            گھر گھر بچھوانے آئی ہے
            مظلوم حسین کی ہمشیرہ
            اسلام بچانے آئی ہے
            شبیر کا ساری دُنیا کو
            پیغام سُنانے آئی ہے
            مظلوم حسین کی ہمشیرہ
            اسلام بچانے آئی ہے

            {'\n\n'}ہَم پر پتھر برساتے ہو
            ہستے ہو جشن مناتے ہو
            سید کا خون بہاتے ہو
            اور باغی باغی کہتے ہو
            شبیر تو پاک نمازی ہے
            یہ تم کو بتانے آئی ہے
            مظلوم حسین کی ہمشیرہ
            اسلام بچانے آئی ہے
            شبیر کا ساری دُنیا کو
            پیغام سُنانے آئی ہے
            مظلوم حسین کی ہمشیرہ
            اسلام بچانے آئی ہے

            {'\n\n'}کونین کی ملکہ کی بیٹی
            وہ شرم و حیا کی شہزادی
            ہائے شام غریباں میں جسکی
            چادر چھی نی تھی وہ بی بی
            دُنیا کی ماوں بہنوں کو
            پردہ سکھلانے آئی ہے
            مظلوم حسین کی ہمشیرہ
            اسلام بچانے آئی ہے
            شبیر کا ساری دُنیا کو
            پیغام سُنانے آئی ہے
            مظلوم حسین کی ہمشیرہ
            اسلام بچانے آئی ہے

            {'\n\n'}جس نے بھائی کی گردن پر
            چلاتے ہوئے خنجر دیکھا تھا
            نا چُھپ نے دوں گی خون تیرا
            شبیر سے جسکا وعدہ تھا
            وہ زینب شام میں بھائی کا
            ماتم کروانے آئی ہے
            مظلوم حسین کی ہمشیرہ
            اسلام بچانے آئی ہے
            شبیر کا ساری دُنیا کو
            پیغام سُنانے آئی ہے
            مظلوم حسین کی ہمشیرہ
            اسلام بچانے آئی ہے

            {'\n\n'}سرور جواد ریہا ہوکر
            جب آئی کربوبلا موزتر
            ہائے پیٹ كے سَر ماتم کر کر
            چلائی بھائی کی تربت پر
            اُٹھ بھائی حسین تیرا چہلوم
            تیری بہن منانے آئی ہے
            مظلوم حسین کی ہمشیرہ
            اسلام بچانے آئی ہے
            شبیر کا ساری دُنیا کو
            پیغام سُنانے آئی ہے
            مظلوم حسین کی ہمشیرہ
            اسلام بچانے آئی ہے{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default MazloomHussain;
