import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const JaAliAsghar = () => {
  return (
    <View>
      <Text style={styles.text}>
            جا علی اصغر جا

            {'\n\n'}آشور كے دن علی اصغر کو
            ماں رُو رُو کر سمجھاتی ہے
            تجھے آخری جنگ لڑنا ہے

            {'\n\n'}تجھے لاج میری رکھنا ہے
            تجھے بابا سنگ جانا ہے
            تجھے آخری جنگ لڑنا ہے

            {'\n\n'}اِس دن كے لیے ہی ماں تیری
            تجھے کربوبلا میں لائی تھی
            اِس دن كے لیے ہی بیٹا
            تجھے ناز سے ماں نے پالا ہے
            تجھے آخری جنگ لڑنا ہے
            جا علی اصغر جا
            آشور كے دن علی اصغر کو
            ماں رُو رُو کر سمجھاتی ہے
            تجھے آخری جنگ لڑنا ہے

            {'\n\n'}تو ماں کا راج دولارا ہے
            تو سب کی آنکھ کا تارا ہے
            تو شیرِ خدا کا پوتا ہے
            تیرا نام علی ہے بیٹا
            تجھے آخری جنگ لڑنا ہے
            آشور كے دن علی اصغر کو
            ماں رُو رُو کر سمجھاتی ہے
            تجھے آخری جنگ لڑنا ہے
            تجھے لاج میری رکھنا ہے
            تجھے بابا سنگ جانا ہے
            تجھے آخری جنگ لڑنا ہے

            {'\n\n'}آ لال تیرے کپڑے بدلوں
            مقتل كے لیے تیار کروں
            آ چہرہ چوم لوں تیرا
            جی بھر كے دیکھ لوں بیٹا
            تجھے آخری جنگ لڑنا ہے
            جا علی اصغر جا
            آشور كے دن علی اصغر کو
            ماں رُو رُو کر سمجھاتی ہے
            تجھے آخری جنگ لڑنا ہے

            {'\n\n'}کبھی گود میں زینب لیتی ہے
            کبھی پیار سكینہ کرتی
            خیموں میں شور ہے برپا
            تو سب کی دعا لیتا جا
            تجھے آخری جنگ لڑنا ہے
            آشور كے دن علی اصغر کو
            ماں رُو رُو کر سمجھاتی ہے
            تجھے آخری جنگ لڑنا ہے
            تجھے لاج میری رکھنا ہے
            تجھے بابا سنگ جانا ہے
            تجھے آخری جنگ لڑنا ہے

            {'\n\n'}میداں میں علی بن کر جانا
            بابا کی نُصرت فرمانا
            شبیر کا تو ہے بیٹا
            عباس چچا ہے تیرا
            تجھے آخری جنگ لڑنا ہے
            جا علی اصغر جا
            آشور كے دن علی اصغر کو
            ماں رُو رُو کر سمجھاتی ہے
            تجھے آخری جنگ لڑنا ہے

            {'\n\n'}ہر ماں نے دی قُربانی ہے
            تُجھے میری لاج نبھانی ہے
            جب ظالم تیر چلائے
            بابا کو نا لگنے پائے
            تجھے آخری جنگ لڑنا ہے
            آشور كے دن علی اصغر کو
            ماں رُو رُو کر سمجھاتی ہے
            تجھے آخری جنگ لڑنا ہے
            تجھے لاج میری رکھنا ہے
            تجھے بابا سنگ جانا ہے
            تجھے آخری جنگ لڑنا ہے

            {'\n\n'}ہائے ، جا علی اصغر جا
            تُجھے آخری جنگ لڑنا ہے
            ہائے ، جا علی اصغر جا{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default JaAliAsghar;
