import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const Janahai = () => {
  return (
    <View>
      <Text style={styles.text}>
            کہتے ہیں جب بھی جس کو بھی جانا ہو کربلا مولا
            ذوار جس کو بنا ہو مولا حسین کا
            لازم ہے اِس كے ویستے عباس کی رِضا
            عباس کی رِضا

            {'\n\n'}عباس بُلالو ذواَر بنا دو
            اک بار ہمیں روزہِ شبیر دِیکھادو
            مولا میرے مولا میرے مولا میرے مولا

            {'\n\n'}جانا ہے کربلا جانا ہے
            با خدا مولا كے دَر ہمیں جانا ہے

            {'\n\n'}عباس بُلالو ذواَر بنا دو
            اک بار ہمیں روزہِ شبیر دِیکھادو
            مولا میرے مولا میرے مولا میرے مولا

            {'\n\n'}بادشاہِ کربلا ہے شاہ نینوا
            جلد بلانا ہمیں جلد بلانا

            {'\n\n'}جب آئے چاند رات محرم کی یا خدا
            اے کاش کربلا میں ہَم بھی ہوں کسی جگہ
            منظر وہ ہَم بھی دیکھلے پرچم کشائی کا
            لبیک یا حسین ہماری بھی ہو سدا
            پانا ہے یہ شرف پانا ہے
            شہہ كے ذواروں میں نام لکھوانا ہے
            جانا ہے کربلا جانا ہے
            با خدا مولا كے دَر ہمیں جانا ہے
            عباس بُلالو ذواَر بنا دو
            اک بار ہمیں روزہِ شبیر دِیکھادو
            مولا میرے مولا میرے مولا میرے مولا
            جانا ہے کربلا جانا ہے
            با خدا مولا كے دَر ہمیں جانا ہے

            {'\n\n'}مولا تمہارے چاہنے والوں کی ہے سدا
            کرنا ہے کربلا میں ہی آشورِ کربلا
            مولا نظر كے سامنے روزہ ہو آپ کا
            ماتم زری كے سامنے ہو آپ کا بَپا
            کہنا ہے بس یہی کہنا ہے
            ہم کو بھی مولا كے سائے میں رہنا ہے
            جانا ہے کربلا جانا ہے
            با خدا مولا كے دَر ہمیں جانا ہے
            عباس بُلالو ذواَر بنا دو
            اک بار ہمیں روزہِ شبیر دِیکھادو
            مولا میرے مولا میرے مولا میرے مولا
            بادشاہِ کربلا ہے شاہ نینوا
            جلد بلانا ہمیں جلد بلانا

            {'\n\n'}مولا ہمیں بھی اپنی زیارت کرائیں
            اے فاطیمہ كے لال ہمیں بھی بولائیں
            ذوار کربلا کا ہمیں بھی بنائیے
            جاگیر باوفا کی ہمیں بھی دکھائے
            آنا ہے روز وہ آنا ہے
            ذکرِ مولا کرنے ہَم کو بھی آنا ہے
            جانا ہے کربلا جانا ہے
            با خدا مولا كے دَر ہمیں جانا ہے
            عباس بُلالو ذواَر بنا دو
            اک بار ہمیں روزہِ شبیر دِیکھادو
            مولا میرے مولا میرے مولا میرے مولا
            جانا ہے کربلا جانا ہے
            با خدا مولا كے دَر ہمیں جانا ہے

            {'\n\n'}دیکھیں نظارہ ہَم بھی وہاں آربائین کا
            پیدل سفر نجف سے کریں سوئے کربلا
            بنٹے سبیل اور تَبَرُّک جگہ جگہ
            جاری رہے اعضاء حسینی کا سلسلہ
            کرنا ہے یہ سفر کرنا ہے
            سنگ عزاداروں كے ہَم کو بھی جانا ہے
            جانا ہے کربلا جانا ہے
            با خدا مولا كے دَر ہمیں جانا ہے
            عباس بُلالو ذواَر بنا دو
            اک بار ہمیں روزہِ شبیر دِیکھادو
            مولا میرے مولا میرے مولا میرے مولا
            بادشاہِ کربلا ہے شاہ نینوا
            جلد بلانا ہمیں جلد بلانا

            {'\n\n'}یہ آرزو ہے کربوبلا جب بھی جائیں گے
            ہَم خیماگاہ مشک و علم لے كے جائے گے
            عباس کا حسین کو نوحہ سنائیں گے
            سادات كے اوجڑنے کا ماتم کرائیں گے
            رونا ہے ہاں ہمیں رونا ہے
            کربلا والوں کا سوگ تو ہونا ہے
            جانا ہے کربلا جانا ہے
            با خدا مولا كے دَر ہمیں جانا ہے
            عباس بُلالو ذواَر بنا دو
            اک بار ہمیں روزہِ شبیر دِیکھادو
            مولا میرے مولا میرے مولا میرے مولا
            جانا ہے کربلا جانا ہے
            با خدا مولا كے دَر ہمیں جانا ہے

            {'\n\n'}کٹ کر گِرے تھے بازوِ عباس جس جگہ
            وا ہسرتا واغُرباتا

            {'\n\n'}کٹ کر گِرے تھے بازوِ عباس جس جگہ
            اکبر جوان کا جہاں چھلنی جیگر ہُوا
            اصغر نے کھایا ہنس کے جہاں تیر ِہورملا
            ڈوبا جہاں پہ خون میں لشکر حسین کا
            جانا ہے ہر جگہ جانا ہے
            جاکے ہر غربت پر اشک برسانا ہے
            جانا ہے کربلا جانا ہے
            با خدا مولا كے دَر ہمیں جانا ہے
            عباس بُلالو ذواَر بنا دو
            اک بار ہمیں روزہِ شبیر دِیکھادو
            مولا میرے مولا میرے مولا میرے مولا
            بادشاہِ کربلا ہے شاہ نینوا
            جلد بلانا ہمیں جلد بلانا

            {'\n\n'}مولا حسین آپ نے کیا کام کر دیا
            اپنے لہو سے خاک کو خاکِ شِفاء کیا
            مولا یہی ہے آپ كے ذوار کی دعا
            ہَم بھی پڑھیں نماز سَرِ عرضِ کربلا
            سننا ہے ہاں ہمیں سننا ہے
            حرامِ مولا کی وہ اذا سننا ہے
            جانا ہے کربلا جانا ہے
            با خدا مولا كے دَر ہمیں جانا ہے
            عباس بُلالو ذواَر بنا دو
            اک بار ہمیں روزہِ شبیر دِیکھادو
            مولا میرے مولا میرے مولا میرے مولا
            جانا ہے کربلا جانا ہے
            با خدا مولا كے دَر ہمیں جانا ہے{'\n'}
      </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default Janahai;
