import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const GhareebeZahra = () => {
  return (
    <View>
        <Text style={styles.text}>
            کیا ھے پامال اسکو رن میں
            ہیں زخم ہی زخم اس بدن میں
            نہیں ھے کوئی اُٹھانے والا
            بہت اکیلا ھے اِس وطن میں
            اِدھر کی سب پسلیاں اُدھر ہیں
            اُدھر کی سب پسلیاں اِدھر ہیں
            جو گرم ریتی پہ بے کفن ھے
            غریبِ زہراؑ کا یہ بدن ھے

            {'\n\n'}یہ وہ بدن ھے کہ جسکا سینہ
            ہاں چومتے تھے شہِ مدینہؐ
            بھرا ھے تیروں سے ھائے غربت
            کہاں پہ سوئیگی اب سکینہؑ
            یہی وہ سینہ ھےجس پہ چڑھکر
            لعیں نے کاٹا حُسینؑ کا سر
            جو گرم ریتی پہ بے کفن ھے
            غریبِ زہراؑ کا یہ بدن ھے

            {'\n\n'}ہوئی تھی وہ جنکی کی نال بندی
            تھے عام گھوڑوں سے اور وزنی
            جو گھوڑے دوڑے تھے اس بدن پہ
            کچلنا اُنکی خصوصیت تھی
            نہ جانے کسطرح ماں نے دیکھا
            سموں کے نیچے غریب بیٹا
            جو گرم ریتی پہ بے کفن ھے
            غریبِ زہراؑ کا یہ بدن ھے

            {'\n\n'}لعیں وہ بجدل تھا نام جسکا
            سرہانے جب اس بدن کے پہنچا
            انگوٹھی کسطرح لوٹتا وہ
            تھا زخمی ہاتھوں میں ورم اتنا
            نہ اُتری ظالم سے جب انگوٹھی
            تو کاٹ کر لے گیا وہ انگلی
            جو گرم ریتی پہ بے کفن ھے
            غریبِ زہراؑ کا یہ بدن ھے

            {'\n\n'}اکیلا لاکھوں سے زخم کھاکر
            یہ سوگیا جب ستم اُٹھاکر
            اندھیرے بن میں اسی بدن سے
            بہن نے پتھر ھٹائے آکر
            نہ جانے زینبؑ نے کیسا دیکھا
            غریب بھائی کا زخمی لاشہ
            جو گرم ریتی پہ بے کفن ھے
            غریبِ زہراؑ کا یہ بدن ھے

            {'\n\n'}سروں کو نیزوں پہ جب چڑھایا
            سر ایک چھوٹا سا مل نہ پایا
            لعیں نے نیزہ زمیں پہ مارا
            تو لاشہ اصغرؑ کا ساتھ آیا
            پدر کے زخمی بدن پہ رکھ کر
            چلایا ننھے گلے پہ خنجر
            جو گرم ریتی پہ بے کفن ھے
            غریبِ زہراؑ کا یہ بدن ھے

            {'\n\n'}پدر کے سینے پہ سونے والی
            جب اس بدن کے قریب پہنچی
            یہ آکے شمرِ لعیں نے دیکھا
            پدر سے لپٹی ہوئی تھی بیٹی
            پکڑکے بالوں سے جب چھڑایا
            بدن زمیں پر تڑپ رہا تھا
            جو گرم ریتی پہ بے کفن ھے
            غریبِ زہراؑ کا یہ بدن ھے

            {'\n\n'}حُسینؑ کی جب لحد پہ جانا
            رضا و ذیشان یاد رکھنا
            بچھی ھے تربت میں اک چٹائی
            یہ دل کی آنکھوں سے دیکھ لینا
            وہیں یہ زخمی بدن رکھا ھے
            صغیرؑ سینے پہ سو رہا ھے{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default GhareebeZahra 
