import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const SakinaBibi = () => {
  return (
    <View>
        <Text style={styles.text}>
            وہ شام کا زندان وہ غربت وہ اندھیرا
            کرتے کا کفن اور سکینہؑ کا جنازہ
            سجادؑ سے جب لاشہ بہن کا نہیں اُٹھا
            لاشے پہ رباب آکے یہ کرنے لگیں نوحہ
            اے بی بیوں تم میری مدد کرنےکو آؤ
            مظلوم سکینہؑ کے جنازے کو اُٹھاؤ

            {'\n\n'}سکینہؑ بی بی کا ہےجنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ

            {'\n\n'}یہ رونے والی کا ہے جنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ
            سکینہؑ بی بی کا ہےجنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ

            {'\n\n'}ہیں ہاتھ اب بھی رسن میں اسکے
            ہم ہی ہیں اب اس وطن میں اسکے
            نہ جانے کب سے یہ تشنہ لب ھے
            نمی نہیں ھے بدن میں اسکے
            یہ میری پیاسی کا ھے جنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ
            سکینہؑ بی بی کا ہےجنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ

            {'\n\n'}یتیم بے کس غریب دکھیا
            تھی کتنی مظلوم و بے سہارا
            چچا کے سر کے قریب لاکر
            پکڑ کے بالوں سے جسکو مارا
            یہ اُس بھتیجی کا ھے جنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ
            سکینہؑ بی بی کا ہےجنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ

            {'\n\n'}وہ جسکی سوکھی ہوئی رگوں پر
            چلا تھا کربوبلا میں خنجر
            بھرا تھا تیروں سے اُسکا سینہ
            ھے جسکو مارا رُلا رُلاکر
            یہ اُسکی بیٹی کا ھے جنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ
            سکینہؑ بی بی کا ہےجنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ

            {'\n\n'}جلا ھے کرتا ہیں کان زخمی
            گلے میں پیوست ہے رسن بھی
            کہیں پہ کھایا تھا تازیانہ
            کہیں یہ ناقے سے گر گئی تھی
            یہ غم کی ماری کا ھے جنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ
            سکینہؑ بی بی کا ہےجنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ

            {'\n\n'}ملا جو پانی تو اسنے لاکر
            گرایا عابدؑ کی بیڑیوں پر
            کہیں سے چادر ملی تو پہلے
            ہمیں اُڑھائی ھے اِسنے آکر
            یہ سبکی پیاری کا ھے جنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ
            سکینہؑ بی بی کا ہےجنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ

            {'\n\n'}ھےاسکے بالوں میں بھی سفیدی
            کمر بھی خم ہو چکی ھے اسکی
            اِسے بھی دربار جب بلایا
            پکڑ کے دیوار یہ چلی تھی
            بتول جیسی کا ھے جنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ
            سکینہؑ بی بی کا ہےجنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ

            {'\n\n'}میں اسکی حالت بتاؤں کیسے
            اب اور غربت سناؤں کیسے
            تمہیں خبر ھے میں اسکی ماں ہوں
            مدد کرو میں اُٹھاؤں کیسے
            یہ میری بچی کا ھے جنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ
            سکینہؑ بی بی کا ہےجنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ

            {'\n\n'}جسے رہائی کی آرزو تھی
            وہ اب ہمیشہ رہے گی قیدی
            مدینے والے بھی رودئیے جب
            رضا و ذیشان ماں پکاری
            یہ شام والی کا ھے جنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ
            سکینہؑ بی بی کا ہےجنازہ
            اُٹھاؤ زینبؑ اُٹھاؤ فضہؑ{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default SakinaBibi 
