import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const ShabbirkeChehre = () => {
  return (
    <View>
        <Text style={styles.text}>
            شبیرؑ کے چہرے سے غم دور کرنے والے
            تُم دور کردو آکر عباسؑ غم ھمارے
            شبیرؑ کے چہرے سے غم دور کرنے والے

            {'\n\n'}تُم بابِ حوائج ھو زینبؑ کا سہارا ھو
            ھو فضل و کرم ھم پہ تُم فضل کے بابا ھو
            ھم کس سے مدد مانگے کوئی نہیں ہمارا
            بس جی رھے ھیں مولاؑ ھم آپکے سہارے
            شبیرؑ کے چہرے سے غم دور کرنے والے
            تُم دور کردو آکر عباسؑ غم ھمارے
            شبیرؑ کے چہرے سے غم دور کرنے والے

            {'\n\n'}ملنے کیلئے آؤں حسرت ھے میرے دل کی
            نا راستہ آساں ھے نا زادِ سفر کوئی
            مشکل یہ میری حل ھو مشکل کشا کے بیٹے
            آجائیں جلد ھم بھی دربار میں تمہارے
            شبیرؑ کے چہرے سے غم دور کرنے والے
            تُم دور کردو آکر عباسؑ غم ھمارے
            شبیرؑ کے چہرے سے غم دور کرنے والے

            {'\n\n'}جب گھر میں عزاخانہ رو روکے سجاتے ھیں
            یہ کہتے ھوئے مومن ھاتھوں کو اُٹھاتے ھیں
            زھراؑ کی دعا ھو تم سنلو دعا ھماری
            آجاؤ میرے گھر بھی اُم البنیںؑ کے پیارے
            شبیرؑ کے چہرے سے غم دور کرنے والے
            تُم دور کردو آکر عباسؑ غم ھمارے
            شبیرؑ کے چہرے سے غم دور کرنے والے

            {'\n\n'}ماتم کی قسم مولاؑ سینے کا سکوں تُم ھو
            اے قمرِ بنی ھاشمؑ اب چین ملے دل کو
            اُس بالی سکینہؑ کی غربت کا واسطہ ھے
            کانوں سے جسکے چھینے ظالم نے گوشوارے
            شبیرؑ کے چہرے سے غم دور کرنے والے
            تُم دور کردو آکر عباسؑ غم ھمارے
            شبیرؑ کے چہرے سے غم دور کرنے والے

            {'\n\n'}اندازِ وفاداری دنیا کو سکھاتے ہیں
            وہ ھاتھ رھیں باقی پرچم جو اُٹھاتے ہیں
            میں واسطہ اُس پل کا دیتا ھوں تمکو مولاؑ
            کٹ کر گرے تھے بازو جب نہر کے کنارے
            شبیرؑ کے چہرے سے غم دور کرنے والے
            تُم دور کردو آکر عباسؑ غم ھمارے
            شبیرؑ کے چہرے سے غم دور کرنے والے

            {'\n\n'}جو گودیاں خالی ہیں اب جلد اُنہیں بھردو
            اُس ماں کے وسیلے سے اولاد عطا کردو
            جھولے سے لپٹکر جو کہتی تھی میرے اصغرؑ
            تم بن رباب کیسے اب زندگی گزارے
            شبیرؑ کے چہرے سے غم دور کرنے والے
            تُم دور کردو آکر عباسؑ غم ھمارے
            شبیرؑ کے چہرے سے غم دور کرنے والے

            {'\n\n'}بیمار شفا پائیں ھو جائیں رھا قیدی
            سجادؑ کی غربت کی ھے تمکو قسم غازیؑ
            آباد رھے سر پہ سایہ تیرے علم کا
            فرشِ پہ آکر رو روکے دل پکارے
            شبیرؑ کے چہرے سے غم دور کرنے والے
            تُم دور کردو آکر عباسؑ غم ھمارے
            شبیرؑ کے چہرے سے غم دور کرنے والے

            {'\n\n'}ذیشان و رضا کیوں نہ فریاد کریں تُم سے
            جب ضربیں لگیں تیرا شبیرؑ کی گردن پہ
            ھر ضرب پہ مولاؑ نے روکر تمہیں پکارا
            منظر وہ یاد کرکے روتے ہیں غم کے مارے
            شبیرؑ کے چہرے سے غم دور کرنے والے
            تُم دور کردو آکر عباسؑ غم ھمارے
            شبیرؑ کے چہرے سے غم دور کرنے والے{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default ShabbirkeChehre 
