import React from 'react';
import {StyleSheet, Text, View} from 'react-native';

const SultaneKarbala = () => {
  return (
    <View>
        <Text style={styles.text}>
            لکھا ھے یاحُسینؑ محرم کے چاند پر
            زہراؑ بھی آگئیں ہیں بقیعہ کو چھوڑ کر
            ٹوٹے ہوئے دلوں کا سہارا ھے جسکا در
            آجاؤ اُس حُسینؑ کی جانب کریں سفر
            جو کبریا کی شان محمدؐ کی جان ھے
            ہاں اپنے زائروں کا جو خود میزبان ھے

            {'\n\n'}دم بدم قدم قدم ھےدل میں عشقِ کربلا
            حُسینا حُسینا
            زائروں کے قافلوں سے آرہی ہے یہ صدا
            حُسینا حُسینا
            چلے چلو بڑھے چلو حُسینؑ کی صدا سنو
            حُسینؑ تمکو بلارہے ہیں ھے سامنے کربلا

            {'\n\n'}اکبرؑ کے ساتھ غازیؑ خود لینے جارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں

            {'\n\n'}پرچم کے سائےمیں ھے عباسؑ کی سواری
            مہماں نوازیوں کی تیاریاں ہیں جاری
            شبیرؑ کا حرم ھے ہلچل ھے خادموں میں
            گنبد پہ شاہِ دیں کے پرچم لگارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں
            اکبرؑ کے ساتھ غازیؑ خود لینے جارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں

            {'\n\n'}جو بےکفن ہے اُسکا دربار سج رہا ھے
            وہ ہورہا ھے جو بھی عباسؑ نے کہا ھے
            ہیں سُرخ روشنی میں کالے لباس والے
            رو روکے فرشِ ماتم خادم بچھارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں
            اکبرؑ کے ساتھ غازیؑ خود لینے جارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں

            {'\n\n'}رو روکے کہرہے ہیں افسوس ہے یہ بی بیؑ
            اےکاش ھم جو ھوتے عاشور والے دن بھی
            نولاکھ ظالموں میں تنہا نا ہوتے مولاؑ
            لبیک کہرہے ہیں اور روتے جارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں

            {'\n\n'}نورانی چہرے والے گالوں پہ خاک مل کر
            زوار آرہے ہیں پیدل نجف سے چل کر
            اِس عشق کےسفرمیں ہرشخص میزباں ہے
            کچھ لوگ راستے سے پتھر ہٹارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں

            {'\n\n'}اُن پر سلام ہو جو بےساکیوں پہ آئے
            پاؤں کے بل نہیں تھے پھر بھی نہ لڑکھڑائے
            ملتی نہیں سبھی کو یہ عشق کی بلندی
            بس یاحُسینؑ کہکر وہ چلتے جارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں
            اکبرؑ کے ساتھ غازیؑ خود لینے جارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں

            {'\n\n'}تھامے ہوئے تبرک راہوں میں جو کھڑے ہیں
            قاسمؑ کا نام لیکر تقسیم کر رہے ہیں
            دونوں جہاں میں ایسا جذبہ کہیں نہ دیکھا
            جو سال بھر کمایا وہ سب لٹارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں
            اکبرؑ کے ساتھ غازیؑ خود لینے جارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں

            {'\n\n'}یہ وہ زمیں ھے جس پر پیاسی رہیں سکینہؑ
            غازیؑ کو یاد کرکے روتی رہیں سکینہؑ
            اب اس زمیں پہ کوئی پیاسہ نہیں ہے دیکھو
            پیاسوں کو مشک والے پانی پلارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں
            اکبرؑ کے ساتھ غازیؑ خود لینے جارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں

            {'\n\n'}ذیشان اور رضا جب مولاؑ کے پاس جانا
            حُرؑ کی قسم ھے تمکو تبدیل ھوکے آنا
            اے زائرینِ مولاؑ ھے اصل یہ زیارت
            اُنکی ھے میزبانی جو حُرؑ بنارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں
            اکبرؑ کے ساتھ غازیؑ خود لینے جارہے ہیں
            سلطانِ کربلا کےمہمان آرہے ہیں

            {'\n\n'}تم اپنے دل میں زیارت کی آرزو رکھنا
            پھر ان کا کام ہے جذبے کی آبرو رکھنا{'\n'}
        </Text>
    </View>
  );
};

var styles = StyleSheet.create({
  text: {
    fontFamily: 'Poppins-Medium',
    fontSize: 22,
    paddingTop: 15,
    paddingBottom: 15,
  },
});

export default SultaneKarbala 
